#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoatEQS_Query

#include "Basic.hpp"


namespace SDK::Params
{

// Function BoatEQS_Query.BoatEQS_Query_C.ProvideActorsSet
// 0x0030 (0x0030 - 0x0000)
struct BoatEQS_Query_C_ProvideActorsSet final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ResultingActorsSet;                                // 0x0010(0x0010)(Parm, OutParm)
	TArray<class ABP_RowBoat_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(BoatEQS_Query_C_ProvideActorsSet) == 0x000008, "Wrong alignment on BoatEQS_Query_C_ProvideActorsSet");
static_assert(sizeof(BoatEQS_Query_C_ProvideActorsSet) == 0x000030, "Wrong size on BoatEQS_Query_C_ProvideActorsSet");
static_assert(offsetof(BoatEQS_Query_C_ProvideActorsSet, QuerierObject) == 0x000000, "Member 'BoatEQS_Query_C_ProvideActorsSet::QuerierObject' has a wrong offset!");
static_assert(offsetof(BoatEQS_Query_C_ProvideActorsSet, QuerierActor) == 0x000008, "Member 'BoatEQS_Query_C_ProvideActorsSet::QuerierActor' has a wrong offset!");
static_assert(offsetof(BoatEQS_Query_C_ProvideActorsSet, ResultingActorsSet) == 0x000010, "Member 'BoatEQS_Query_C_ProvideActorsSet::ResultingActorsSet' has a wrong offset!");
static_assert(offsetof(BoatEQS_Query_C_ProvideActorsSet, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BoatEQS_Query_C_ProvideActorsSet::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

}

