#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Antize

#include "Basic.hpp"

#include "S_LevelStats_structs.hpp"


namespace SDK::Params
{

// Function BP_Antize.BP_Antize_C.FinishedEndScene
// 0x0018 (0x0018 - 0x0000)
struct BP_Antize_C_FinishedEndScene final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_Get_Save_Game_SaveGame;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_FinishedEndScene) == 0x000008, "Wrong alignment on BP_Antize_C_FinishedEndScene");
static_assert(sizeof(BP_Antize_C_FinishedEndScene) == 0x000018, "Wrong size on BP_Antize_C_FinishedEndScene");
static_assert(offsetof(BP_Antize_C_FinishedEndScene, __WorldContext) == 0x000000, "Member 'BP_Antize_C_FinishedEndScene::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedEndScene, CallFunc_Get_Save_Game_SaveGame) == 0x000008, "Member 'BP_Antize_C_FinishedEndScene::CallFunc_Get_Save_Game_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedEndScene, CallFunc_SaveGameToSlot_ReturnValue) == 0x000010, "Member 'BP_Antize_C_FinishedEndScene::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.ConvertStringToFloat
// 0x0038 (0x0038 - 0x0000)
struct BP_Antize_C_ConvertStringToFloat final
{
public:
	class FString                                 In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Out;                                               // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Antize_C_ConvertStringToFloat) == 0x000008, "Wrong alignment on BP_Antize_C_ConvertStringToFloat");
static_assert(sizeof(BP_Antize_C_ConvertStringToFloat) == 0x000038, "Wrong size on BP_Antize_C_ConvertStringToFloat");
static_assert(offsetof(BP_Antize_C_ConvertStringToFloat, In) == 0x000000, "Member 'BP_Antize_C_ConvertStringToFloat::In' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_ConvertStringToFloat, __WorldContext) == 0x000010, "Member 'BP_Antize_C_ConvertStringToFloat::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_ConvertStringToFloat, Out) == 0x000018, "Member 'BP_Antize_C_ConvertStringToFloat::Out' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_ConvertStringToFloat, CallFunc_Replace_ReturnValue) == 0x000020, "Member 'BP_Antize_C_ConvertStringToFloat::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_ConvertStringToFloat, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000030, "Member 'BP_Antize_C_ConvertStringToFloat::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.SaveGame
// 0x0028 (0x0028 - 0x0000)
struct BP_Antize_C_SaveGame final
{
public:
	class UBP_MySaveGame_C*                       SaveGame_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Local_SaveName;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_SaveGame) == 0x000008, "Wrong alignment on BP_Antize_C_SaveGame");
static_assert(sizeof(BP_Antize_C_SaveGame) == 0x000028, "Wrong size on BP_Antize_C_SaveGame");
static_assert(offsetof(BP_Antize_C_SaveGame, SaveGame_0) == 0x000000, "Member 'BP_Antize_C_SaveGame::SaveGame_0' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_SaveGame, __WorldContext) == 0x000008, "Member 'BP_Antize_C_SaveGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_SaveGame, Local_SaveName) == 0x000010, "Member 'BP_Antize_C_SaveGame::Local_SaveName' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_SaveGame, CallFunc_SaveGameToSlot_ReturnValue) == 0x000020, "Member 'BP_Antize_C_SaveGame::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.FinishedCutscene
// 0x0018 (0x0018 - 0x0000)
struct BP_Antize_C_FinishedCutscene final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_Get_Save_Game_SaveGame;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_FinishedCutscene) == 0x000008, "Wrong alignment on BP_Antize_C_FinishedCutscene");
static_assert(sizeof(BP_Antize_C_FinishedCutscene) == 0x000018, "Wrong size on BP_Antize_C_FinishedCutscene");
static_assert(offsetof(BP_Antize_C_FinishedCutscene, __WorldContext) == 0x000000, "Member 'BP_Antize_C_FinishedCutscene::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedCutscene, CallFunc_Get_Save_Game_SaveGame) == 0x000008, "Member 'BP_Antize_C_FinishedCutscene::CallFunc_Get_Save_Game_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedCutscene, CallFunc_SaveGameToSlot_ReturnValue) == 0x000010, "Member 'BP_Antize_C_FinishedCutscene::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Get Save Game
// 0x0030 (0x0030 - 0x0000)
struct BP_Antize_C_Get_Save_Game final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_Create_New_Save_File_SaveGame;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       K2Node_DynamicCast_AsBP_My_Save_Game;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Get_Save_Game) == 0x000008, "Wrong alignment on BP_Antize_C_Get_Save_Game");
static_assert(sizeof(BP_Antize_C_Get_Save_Game) == 0x000030, "Wrong size on BP_Antize_C_Get_Save_Game");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, __WorldContext) == 0x000000, "Member 'BP_Antize_C_Get_Save_Game::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, SaveGame) == 0x000008, "Member 'BP_Antize_C_Get_Save_Game::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000010, "Member 'BP_Antize_C_Get_Save_Game::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, CallFunc_Create_New_Save_File_SaveGame) == 0x000018, "Member 'BP_Antize_C_Get_Save_Game::CallFunc_Create_New_Save_File_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, K2Node_DynamicCast_AsBP_My_Save_Game) == 0x000020, "Member 'BP_Antize_C_Get_Save_Game::K2Node_DynamicCast_AsBP_My_Save_Game' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Antize_C_Get_Save_Game::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Get_Save_Game, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000029, "Member 'BP_Antize_C_Get_Save_Game::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.FinishedLevel
// 0x0098 (0x0098 - 0x0000)
struct BP_Antize_C_FinishedLevel final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_Get_Save_Game_SaveGame;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LevelStats                          K2Node_MakeStruct_S_LevelStats;                    // 0x0018(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelStats                          CallFunc_Array_Get_Item;                           // 0x0058(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_FinishedLevel) == 0x000008, "Wrong alignment on BP_Antize_C_FinishedLevel");
static_assert(sizeof(BP_Antize_C_FinishedLevel) == 0x000098, "Wrong size on BP_Antize_C_FinishedLevel");
static_assert(offsetof(BP_Antize_C_FinishedLevel, LevelIndex) == 0x000000, "Member 'BP_Antize_C_FinishedLevel::LevelIndex' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, Time) == 0x000004, "Member 'BP_Antize_C_FinishedLevel::Time' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, __WorldContext) == 0x000008, "Member 'BP_Antize_C_FinishedLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_Get_Save_Game_SaveGame) == 0x000010, "Member 'BP_Antize_C_FinishedLevel::CallFunc_Get_Save_Game_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, K2Node_MakeStruct_S_LevelStats) == 0x000018, "Member 'BP_Antize_C_FinishedLevel::K2Node_MakeStruct_S_LevelStats' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_SaveGameToSlot_ReturnValue) == 0x000050, "Member 'BP_Antize_C_FinishedLevel::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Antize_C_FinishedLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_Antize_C_FinishedLevel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000091, "Member 'BP_Antize_C_FinishedLevel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_FinishedLevel, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'BP_Antize_C_FinishedLevel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Create New Save File
// 0x0030 (0x0030 - 0x0000)
struct BP_Antize_C_Create_New_Save_File final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Local_SaveName;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Create_New_Save_File) == 0x000008, "Wrong alignment on BP_Antize_C_Create_New_Save_File");
static_assert(sizeof(BP_Antize_C_Create_New_Save_File) == 0x000030, "Wrong size on BP_Antize_C_Create_New_Save_File");
static_assert(offsetof(BP_Antize_C_Create_New_Save_File, __WorldContext) == 0x000000, "Member 'BP_Antize_C_Create_New_Save_File::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Create_New_Save_File, SaveGame) == 0x000008, "Member 'BP_Antize_C_Create_New_Save_File::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Create_New_Save_File, Local_SaveName) == 0x000010, "Member 'BP_Antize_C_Create_New_Save_File::Local_SaveName' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Create_New_Save_File, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'BP_Antize_C_Create_New_Save_File::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Create_New_Save_File, CallFunc_SaveGameToSlot_ReturnValue) == 0x000028, "Member 'BP_Antize_C_Create_New_Save_File::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Finished Level Lobby Easy
// 0x0098 (0x0098 - 0x0000)
struct BP_Antize_C_Finished_Level_Lobby_Easy final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    CallFunc_GetLobbySaveGame_SaveGame;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelStats                          CallFunc_Array_Get_Item;                           // 0x0020(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_LevelStats                          K2Node_MakeStruct_S_LevelStats;                    // 0x0058(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Finished_Level_Lobby_Easy) == 0x000008, "Wrong alignment on BP_Antize_C_Finished_Level_Lobby_Easy");
static_assert(sizeof(BP_Antize_C_Finished_Level_Lobby_Easy) == 0x000098, "Wrong size on BP_Antize_C_Finished_Level_Lobby_Easy");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, LevelIndex) == 0x000000, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::LevelIndex' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, Time) == 0x000004, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::Time' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, __WorldContext) == 0x000008, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_GetLobbySaveGame_SaveGame) == 0x000010, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_GetLobbySaveGame_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_SaveGameToSlot_ReturnValue) == 0x000018, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, K2Node_MakeStruct_S_LevelStats) == 0x000058, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::K2Node_MakeStruct_S_LevelStats' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000091, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Easy, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'BP_Antize_C_Finished_Level_Lobby_Easy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.GetLobbySaveGame
// 0x0030 (0x0030 - 0x0000)
struct BP_Antize_C_GetLobbySaveGame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    CallFunc_CreateNewLobbySave_SaveGame;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    K2Node_DynamicCast_AsBP_Lobby_Save_Game;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_GetLobbySaveGame) == 0x000008, "Wrong alignment on BP_Antize_C_GetLobbySaveGame");
static_assert(sizeof(BP_Antize_C_GetLobbySaveGame) == 0x000030, "Wrong size on BP_Antize_C_GetLobbySaveGame");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, __WorldContext) == 0x000000, "Member 'BP_Antize_C_GetLobbySaveGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, SaveGame) == 0x000008, "Member 'BP_Antize_C_GetLobbySaveGame::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000010, "Member 'BP_Antize_C_GetLobbySaveGame::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, CallFunc_CreateNewLobbySave_SaveGame) == 0x000018, "Member 'BP_Antize_C_GetLobbySaveGame::CallFunc_CreateNewLobbySave_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, K2Node_DynamicCast_AsBP_Lobby_Save_Game) == 0x000020, "Member 'BP_Antize_C_GetLobbySaveGame::K2Node_DynamicCast_AsBP_Lobby_Save_Game' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Antize_C_GetLobbySaveGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_GetLobbySaveGame, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000029, "Member 'BP_Antize_C_GetLobbySaveGame::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.CreateNewLobbySave
// 0x0030 (0x0030 - 0x0000)
struct BP_Antize_C_CreateNewLobbySave final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Local_SaveName;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_CreateNewLobbySave) == 0x000008, "Wrong alignment on BP_Antize_C_CreateNewLobbySave");
static_assert(sizeof(BP_Antize_C_CreateNewLobbySave) == 0x000030, "Wrong size on BP_Antize_C_CreateNewLobbySave");
static_assert(offsetof(BP_Antize_C_CreateNewLobbySave, __WorldContext) == 0x000000, "Member 'BP_Antize_C_CreateNewLobbySave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_CreateNewLobbySave, SaveGame) == 0x000008, "Member 'BP_Antize_C_CreateNewLobbySave::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_CreateNewLobbySave, Local_SaveName) == 0x000010, "Member 'BP_Antize_C_CreateNewLobbySave::Local_SaveName' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_CreateNewLobbySave, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'BP_Antize_C_CreateNewLobbySave::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_CreateNewLobbySave, CallFunc_SaveGameToSlot_ReturnValue) == 0x000028, "Member 'BP_Antize_C_CreateNewLobbySave::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Finished Level Lobby Normal
// 0x0098 (0x0098 - 0x0000)
struct BP_Antize_C_Finished_Level_Lobby_Normal final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    CallFunc_GetLobbySaveGame_SaveGame;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelStats                          CallFunc_Array_Get_Item;                           // 0x0020(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_LevelStats                          K2Node_MakeStruct_S_LevelStats;                    // 0x0058(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Finished_Level_Lobby_Normal) == 0x000008, "Wrong alignment on BP_Antize_C_Finished_Level_Lobby_Normal");
static_assert(sizeof(BP_Antize_C_Finished_Level_Lobby_Normal) == 0x000098, "Wrong size on BP_Antize_C_Finished_Level_Lobby_Normal");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, LevelIndex) == 0x000000, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::LevelIndex' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, Time) == 0x000004, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::Time' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, __WorldContext) == 0x000008, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_GetLobbySaveGame_SaveGame) == 0x000010, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_GetLobbySaveGame_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_SaveGameToSlot_ReturnValue) == 0x000018, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, K2Node_MakeStruct_S_LevelStats) == 0x000058, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::K2Node_MakeStruct_S_LevelStats' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000091, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Normal, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'BP_Antize_C_Finished_Level_Lobby_Normal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Finished Level Lobby Hard
// 0x0098 (0x0098 - 0x0000)
struct BP_Antize_C_Finished_Level_Lobby_Hard final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LobbySaveGame_C*                    CallFunc_GetLobbySaveGame_SaveGame;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelStats                          CallFunc_Array_Get_Item;                           // 0x0020(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_LevelStats                          K2Node_MakeStruct_S_LevelStats;                    // 0x0058(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Finished_Level_Lobby_Hard) == 0x000008, "Wrong alignment on BP_Antize_C_Finished_Level_Lobby_Hard");
static_assert(sizeof(BP_Antize_C_Finished_Level_Lobby_Hard) == 0x000098, "Wrong size on BP_Antize_C_Finished_Level_Lobby_Hard");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, LevelIndex) == 0x000000, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::LevelIndex' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, Time) == 0x000004, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::Time' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, __WorldContext) == 0x000008, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_GetLobbySaveGame_SaveGame) == 0x000010, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_GetLobbySaveGame_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_SaveGameToSlot_ReturnValue) == 0x000018, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, K2Node_MakeStruct_S_LevelStats) == 0x000058, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::K2Node_MakeStruct_S_LevelStats' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000091, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Finished_Level_Lobby_Hard, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'BP_Antize_C_Finished_Level_Lobby_Hard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Load Saves
// 0x0030 (0x0030 - 0x0000)
struct BP_Antize_C_Load_Saves final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       CallFunc_Create_New_Save_File_SaveGame;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MySaveGame_C*                       K2Node_DynamicCast_AsBP_My_Save_Game;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Load_Saves) == 0x000008, "Wrong alignment on BP_Antize_C_Load_Saves");
static_assert(sizeof(BP_Antize_C_Load_Saves) == 0x000030, "Wrong size on BP_Antize_C_Load_Saves");
static_assert(offsetof(BP_Antize_C_Load_Saves, __WorldContext) == 0x000000, "Member 'BP_Antize_C_Load_Saves::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, SaveGame) == 0x000008, "Member 'BP_Antize_C_Load_Saves::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000010, "Member 'BP_Antize_C_Load_Saves::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, CallFunc_Create_New_Save_File_SaveGame) == 0x000018, "Member 'BP_Antize_C_Load_Saves::CallFunc_Create_New_Save_File_SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, K2Node_DynamicCast_AsBP_My_Save_Game) == 0x000020, "Member 'BP_Antize_C_Load_Saves::K2Node_DynamicCast_AsBP_My_Save_Game' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Antize_C_Load_Saves::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Load_Saves, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000029, "Member 'BP_Antize_C_Load_Saves::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function BP_Antize.BP_Antize_C.Save Slot
// 0x0018 (0x0018 - 0x0000)
struct BP_Antize_C_Save_Slot final
{
public:
	class UBP_MySaveGame_C*                       SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Antize_C_Save_Slot) == 0x000008, "Wrong alignment on BP_Antize_C_Save_Slot");
static_assert(sizeof(BP_Antize_C_Save_Slot) == 0x000018, "Wrong size on BP_Antize_C_Save_Slot");
static_assert(offsetof(BP_Antize_C_Save_Slot, SaveGame) == 0x000000, "Member 'BP_Antize_C_Save_Slot::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Save_Slot, __WorldContext) == 0x000008, "Member 'BP_Antize_C_Save_Slot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Save_Slot, Success) == 0x000010, "Member 'BP_Antize_C_Save_Slot::Success' has a wrong offset!");
static_assert(offsetof(BP_Antize_C_Save_Slot, CallFunc_SaveGameToSlot_ReturnValue) == 0x000011, "Member 'BP_Antize_C_Save_Slot::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

}

