#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Crowbar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.ExecuteUbergraph_BP_Item_Crowbar
// 0x0330 (0x0330 - 0x0000)
struct BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACrowbar_BP_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0120(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Target;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_CustomEvent_Character;                      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_Breakable_C>       K2Node_DynamicCast_AsBP_Breakable;                 // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_DynamicCast_AsFancy_Character;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_DynamicCast_AsFancy_Character_1;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInRadians_ReturnValue; // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0214(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F[0x1];                                      // 0x029F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar) == 0x000010, "Wrong alignment on BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar");
static_assert(sizeof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar) == 0x000330, "Wrong size on BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, EntryPoint) == 0x000000, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_7) == 0x000004, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_6) == 0x00001C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_5) == 0x000034, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, Temp_name_Variable) == 0x00004C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_4) == 0x000064, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_3) == 0x00006C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_2) == 0x000084, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_5) == 0x00008C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_1) == 0x00009C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName) == 0x0000B4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000BC, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, Temp_name_Variable_1) == 0x0000CC, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, Temp_object_Variable) == 0x000120, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_HasAuthority_ReturnValue) == 0x000130, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_9) == 0x000134, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_HasAuthority_ReturnValue_1) == 0x00013C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_Target) == 0x000140, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_Character) == 0x000148, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_AsBP_Breakable) == 0x000150, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_AsBP_Breakable' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_8) == 0x000164, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000178, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_HasAuthority_ReturnValue_2) == 0x000180, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_GetOwner_ReturnValue) == 0x000188, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_AsFancy_Character) == 0x000190, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_AsFancy_Character' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CustomEvent_NotifyName_8) == 0x00019C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001A4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001A5, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001A8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0001B8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_GetOwner_ReturnValue_1) == 0x0001C0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_AsFancy_Character_1) == 0x0001C8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_AsFancy_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_GetForwardVector_ReturnValue) == 0x0001D4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001E0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_RandomUnitVectorInConeInRadians_ReturnValue) == 0x0001EC, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_RandomUnitVectorInConeInRadians_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001F8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_IsValid_ReturnValue_1) == 0x000204, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_Add_VectorVector_ReturnValue) == 0x000208, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_LineTraceSingle_OutHit) == 0x000214, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_LineTraceSingle_ReturnValue) == 0x00029C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_bBlockingHit) == 0x00029D, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_bInitialOverlap) == 0x00029E, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_Time) == 0x0002A0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_Distance) == 0x0002A4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_Location) == 0x0002A8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B4, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_Normal) == 0x0002C0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_ImpactNormal) == 0x0002CC, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_PhysMat) == 0x0002D8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_HitActor) == 0x0002E0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_HitComponent) == 0x0002E8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_HitBoneName) == 0x0002F0, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_HitItem) == 0x0002F8, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_ElementIndex) == 0x0002FC, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_FaceIndex) == 0x000300, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_TraceStart) == 0x000304, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BreakHitResult_TraceEnd) == 0x000310, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, K2Node_CreateDelegate_OutputDelegate_9) == 0x00031C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_DoesImplementInterface_ReturnValue) == 0x00032C, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar, CallFunc_BooleanAND_ReturnValue) == 0x00032D, "Member 'BP_Item_Crowbar_C_ExecuteUbergraph_BP_Item_Crowbar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.Damage_SERVER
// 0x0010 (0x0010 - 0x0000)
struct BP_Item_Crowbar_C_Damage_SERVER final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_Damage_SERVER) == 0x000008, "Wrong alignment on BP_Item_Crowbar_C_Damage_SERVER");
static_assert(sizeof(BP_Item_Crowbar_C_Damage_SERVER) == 0x000010, "Wrong size on BP_Item_Crowbar_C_Damage_SERVER");
static_assert(offsetof(BP_Item_Crowbar_C_Damage_SERVER, Target) == 0x000000, "Member 'BP_Item_Crowbar_C_Damage_SERVER::Target' has a wrong offset!");
static_assert(offsetof(BP_Item_Crowbar_C_Damage_SERVER, Character) == 0x000008, "Member 'BP_Item_Crowbar_C_Damage_SERVER::Character' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnCompleted_BE8B199649F76BBA28D0A884255F0BFA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(sizeof(BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(offsetof(BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnCompleted_BE8B199649F76BBA28D0A884255F0BFA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(sizeof(BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(offsetof(BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnBlendOut_BE8B199649F76BBA28D0A884255F0BFA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(sizeof(BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(offsetof(BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnInterrupted_BE8B199649F76BBA28D0A884255F0BFA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(sizeof(BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(offsetof(BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnNotifyBegin_BE8B199649F76BBA28D0A884255F0BFA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(sizeof(BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA");
static_assert(offsetof(BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnNotifyEnd_BE8B199649F76BBA28D0A884255F0BFA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnCompleted_751D76F146E38F09943798A236AB1CAA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA");
static_assert(sizeof(BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA");
static_assert(offsetof(BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnCompleted_751D76F146E38F09943798A236AB1CAA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnBlendOut_751D76F146E38F09943798A236AB1CAA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA");
static_assert(sizeof(BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA");
static_assert(offsetof(BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnBlendOut_751D76F146E38F09943798A236AB1CAA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnInterrupted_751D76F146E38F09943798A236AB1CAA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA");
static_assert(sizeof(BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA");
static_assert(offsetof(BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnInterrupted_751D76F146E38F09943798A236AB1CAA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnNotifyBegin_751D76F146E38F09943798A236AB1CAA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA");
static_assert(sizeof(BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA");
static_assert(offsetof(BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnNotifyBegin_751D76F146E38F09943798A236AB1CAA::NotifyName' has a wrong offset!");

// Function BP_Item_Crowbar.BP_Item_Crowbar_C.OnNotifyEnd_751D76F146E38F09943798A236AB1CAA
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA) == 0x000004, "Wrong alignment on BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA");
static_assert(sizeof(BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA) == 0x000008, "Wrong size on BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA");
static_assert(offsetof(BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA, NotifyName) == 0x000000, "Member 'BP_Item_Crowbar_C_OnNotifyEnd_751D76F146E38F09943798A236AB1CAA::NotifyName' has a wrong offset!");

}

