#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Old_Instance

#include "Basic.hpp"

#include "AdvancedSessions_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK::Params
{

// Function Old_Instance.Old_Instance_C.ExecuteUbergraph_Old_Instance
// 0x0808 (0x0808 - 0x0000)
struct Old_Instance_C_ExecuteUbergraph_Old_Instance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId;               // 0x0010(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_1;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_4;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_WidgetRef;                      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_ParentRef_2;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_LevelName;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxPlayer;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPrivate;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ServerName;                     // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyBool_ReturnValue; // 0x00E0(0x0020)()
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue; // 0x0100(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Code;                           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_3;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_ParentRef_1;                    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1; // 0x0160(0x0020)()
	struct FSessionsSearchSetting                 CallFunc_MakeLiteralSessionSearchProperty_ReturnValue; // 0x0180(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_2;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x01C0(0x0018)()
	class UW_LoadingScreen_C*                     CallFunc_Create_ReturnValue;                       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable;                              // 0x01F8(0x0010)(ReferenceParm)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item;                           // 0x0208(0x0108)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                K2Node_CustomEvent_Session;                        // 0x0318(0x0108)()
	class APlayerController*                      K2Node_CustomEvent_PlayerController_1;             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_ParentRef;                      // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowLoadingScreen;              // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue;                  // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0448(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_1;                      // 0x0458(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MainMenu_C*                          K2Node_DynamicCast_AsW_Main_Menu;                  // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492[0x2];                                      // 0x0492(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0494(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x04A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable_1;                            // 0x04B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_2;                      // 0x04D0(0x0010)(ConstParm, ReferenceParm)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2; // 0x04E0(0x0020)()
	struct FSessionsSearchSetting                 CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_1; // 0x0500(0x0028)()
	TArray<struct FSessionsSearchSetting>         K2Node_MakeArray_Array;                            // 0x0528(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0538(0x0010)(ZeroConstructor, NoDestructor)
	class UFindSessionsCallbackProxyAdvanced*     CallFunc_FindSessionsAdvanced_ReturnValue;         // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_3;                      // 0x0568(0x0010)(ConstParm, ReferenceParm)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_1; // 0x0578(0x0020)()
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0598(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FSessionPropertyKeyPair>        K2Node_MakeArray_Array_1;                          // 0x05A8(0x0010)(ConstParm, ReferenceParm)
	class UCreateSessionCallbackProxyAdvanced*    CallFunc_CreateAdvancedSession_ReturnValue;        // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_2; // 0x05C0(0x0020)()
	struct FSessionsSearchSetting                 CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_2; // 0x05E0(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionsSearchSetting>         K2Node_MakeArray_Array_2;                          // 0x0610(0x0010)(ConstParm, ReferenceParm)
	class UFindSessionsCallbackProxyAdvanced*     CallFunc_FindSessionsAdvanced_ReturnValue_1;       // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_LocalPlayerNum;                       // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPUniqueNetId                         K2Node_Event_PersonInvited;                        // 0x0630(0x0020)()
	struct FBlueprintSessionResult                K2Node_Event_SessionToJoin;                        // 0x0650(0x0108)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0768(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue_1;                // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         K2Node_Event_PlayerId;                             // 0x0790(0x0020)()
	bool                                          K2Node_Event_bIsTalking;                           // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x07B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_UNetIDUnetID_ReturnValue;      // 0x07C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5[0x3];                                      // 0x07C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_AchievementName;                // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementWriteCallbackProxy*         CallFunc_WriteAchievementProgress_ReturnValue;     // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller;         // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2[0x6];                                      // 0x07F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobby_PlayerController_C*              K2Node_DynamicCast_AsLobby_Player_Controller;      // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0801(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Old_Instance_C_ExecuteUbergraph_Old_Instance) == 0x000008, "Wrong alignment on Old_Instance_C_ExecuteUbergraph_Old_Instance");
static_assert(sizeof(Old_Instance_C_ExecuteUbergraph_Old_Instance) == 0x000808, "Wrong size on Old_Instance_C_ExecuteUbergraph_Old_Instance");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, EntryPoint) == 0x000000, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::EntryPoint' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GetUniqueNetID_UniqueNetId) == 0x000010, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GetUniqueNetID_UniqueNetId' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenAchievementName_1) == 0x000040, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenAchievementName_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenProgress_1) == 0x000048, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenProgress_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenUserTag_1) == 0x00004C, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenUserTag_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenAchievementName) == 0x000060, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenProgress) == 0x000068, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenProgress' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WrittenUserTag) == 0x00006C, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WrittenUserTag' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, Temp_int_Variable) == 0x000080, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, Temp_float_Variable) == 0x000084, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, Temp_name_Variable) == 0x000088, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_PlayerController_4) == 0x000090, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_PlayerController_4' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_WidgetRef) == 0x000098, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_WidgetRef' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_ParentRef_2) == 0x0000A0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_ParentRef_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_LevelName) == 0x0000A8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_MaxPlayer) == 0x0000B0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_MaxPlayer' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_IsPrivate) == 0x0000B4, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_IsPrivate' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_ServerName) == 0x0000B8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_ServerName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyBool_ReturnValue) == 0x0000E0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue) == 0x000100, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Not_PreBool_ReturnValue) == 0x000120, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Code) == 0x000128, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_PlayerController_3) == 0x000138, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_PlayerController_3' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_ParentRef_1) == 0x000140, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_ParentRef_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_1) == 0x000159, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1) == 0x000160, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionSearchProperty_ReturnValue) == 0x000180, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionSearchProperty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_PlayerController_2) == 0x0001B8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_PlayerController_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Message) == 0x0001C0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Create_ReturnValue) == 0x0001D8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001E4, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, Temp_struct_Variable) == 0x0001F8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Array_Get_Item) == 0x000208, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Array_Length_ReturnValue) == 0x000310, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Session) == 0x000318, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Session' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_PlayerController_1) == 0x000420, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_PlayerController_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_ParentRef) == 0x000428, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_ParentRef' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_ShowLoadingScreen) == 0x000430, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_ShowLoadingScreen' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000431, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_JoinSession_ReturnValue) == 0x000438, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_JoinSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_3) == 0x000440, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Results) == 0x000448, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Results_1) == 0x000458, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_6) == 0x000468, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_PlayerController) == 0x000478, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Widget) == 0x000480, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_AsW_Main_Menu) == 0x000488, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_AsW_Main_Menu' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_bSuccess) == 0x000490, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_4) == 0x000491, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_7) == 0x000494, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_8) == 0x0004A4, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, Temp_struct_Variable_1) == 0x0004B8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_Array_Length_ReturnValue_1) == 0x0004C8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0004CC, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Results_2) == 0x0004D0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Results_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2) == 0x0004E0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_1) == 0x000500, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_MakeArray_Array) == 0x000528, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_9) == 0x000538, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_FindSessionsAdvanced_ReturnValue) == 0x000548, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_FindSessionsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_10) == 0x000550, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_5) == 0x000560, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_Results_3) == 0x000568, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_Results_3' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_1) == 0x000578, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_11) == 0x000598, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_MakeArray_Array_1) == 0x0005A8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_CreateAdvancedSession_ReturnValue) == 0x0005B8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_CreateAdvancedSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_2) == 0x0005C0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionPropertyBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_2) == 0x0005E0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_MakeLiteralSessionSearchProperty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_6) == 0x000608, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_MakeArray_Array_2) == 0x000610, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_FindSessionsAdvanced_ReturnValue_1) == 0x000620, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_FindSessionsAdvanced_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_7) == 0x000628, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_Event_LocalPlayerNum) == 0x00062C, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_Event_LocalPlayerNum' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_Event_PersonInvited) == 0x000630, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_Event_PersonInvited' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_Event_SessionToJoin) == 0x000650, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_Event_SessionToJoin' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GetPlayerController_ReturnValue_1) == 0x000758, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_DestroySession_ReturnValue) == 0x000760, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_DestroySession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_12) == 0x000768, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_8) == 0x000778, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_JoinSession_ReturnValue_1) == 0x000780, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_JoinSession_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_9) == 0x000788, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_Event_PlayerId) == 0x000790, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_Event_PlayerId' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_Event_bIsTalking) == 0x0007B0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_Event_bIsTalking' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CreateDelegate_OutputDelegate_13) == 0x0007B4, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_EqualEqual_UNetIDUnetID_ReturnValue) == 0x0007C4, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_EqualEqual_UNetIDUnetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_CustomEvent_AchievementName) == 0x0007C8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_CustomEvent_AchievementName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GetPlayerController_ReturnValue_2) == 0x0007D0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_GetPlayerController_ReturnValue_3) == 0x0007D8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_WriteAchievementProgress_ReturnValue) == 0x0007E0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_WriteAchievementProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_AsMP_Player_Controller) == 0x0007E8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_AsMP_Player_Controller' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_bSuccess_1) == 0x0007F0, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_10) == 0x0007F1, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_AsLobby_Player_Controller) == 0x0007F8, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_AsLobby_Player_Controller' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, K2Node_DynamicCast_bSuccess_2) == 0x000800, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ExecuteUbergraph_Old_Instance, CallFunc_IsValid_ReturnValue_11) == 0x000801, "Member 'Old_Instance_C_ExecuteUbergraph_Old_Instance::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.UnlockAchievement
// 0x0008 (0x0008 - 0x0000)
struct Old_Instance_C_UnlockAchievement final
{
public:
	class FName                                   AchievementName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Old_Instance_C_UnlockAchievement) == 0x000004, "Wrong alignment on Old_Instance_C_UnlockAchievement");
static_assert(sizeof(Old_Instance_C_UnlockAchievement) == 0x000008, "Wrong size on Old_Instance_C_UnlockAchievement");
static_assert(offsetof(Old_Instance_C_UnlockAchievement, AchievementName) == 0x000000, "Member 'Old_Instance_C_UnlockAchievement::AchievementName' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.OnPlayerTalkingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct Old_Instance_C_OnPlayerTalkingStateChanged final
{
public:
	struct FBPUniqueNetId                         PlayerId;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bIsTalking;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Old_Instance_C_OnPlayerTalkingStateChanged) == 0x000008, "Wrong alignment on Old_Instance_C_OnPlayerTalkingStateChanged");
static_assert(sizeof(Old_Instance_C_OnPlayerTalkingStateChanged) == 0x000028, "Wrong size on Old_Instance_C_OnPlayerTalkingStateChanged");
static_assert(offsetof(Old_Instance_C_OnPlayerTalkingStateChanged, PlayerId) == 0x000000, "Member 'Old_Instance_C_OnPlayerTalkingStateChanged::PlayerId' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_OnPlayerTalkingStateChanged, bIsTalking) == 0x000020, "Member 'Old_Instance_C_OnPlayerTalkingStateChanged::bIsTalking' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.OnSessionInviteAccepted
// 0x0130 (0x0130 - 0x0000)
struct Old_Instance_C_OnSessionInviteAccepted final
{
public:
	int32                                         LocalPlayerNum;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         PersonInvited;                                     // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBlueprintSessionResult                SessionToJoin;                                     // 0x0028(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Old_Instance_C_OnSessionInviteAccepted) == 0x000008, "Wrong alignment on Old_Instance_C_OnSessionInviteAccepted");
static_assert(sizeof(Old_Instance_C_OnSessionInviteAccepted) == 0x000130, "Wrong size on Old_Instance_C_OnSessionInviteAccepted");
static_assert(offsetof(Old_Instance_C_OnSessionInviteAccepted, LocalPlayerNum) == 0x000000, "Member 'Old_Instance_C_OnSessionInviteAccepted::LocalPlayerNum' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_OnSessionInviteAccepted, PersonInvited) == 0x000008, "Member 'Old_Instance_C_OnSessionInviteAccepted::PersonInvited' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_OnSessionInviteAccepted, SessionToJoin) == 0x000028, "Member 'Old_Instance_C_OnSessionInviteAccepted::SessionToJoin' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.ResetAfterErrorFocus
// 0x0010 (0x0010 - 0x0000)
struct Old_Instance_C_ResetAfterErrorFocus final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Old_Instance_C_ResetAfterErrorFocus) == 0x000008, "Wrong alignment on Old_Instance_C_ResetAfterErrorFocus");
static_assert(sizeof(Old_Instance_C_ResetAfterErrorFocus) == 0x000010, "Wrong size on Old_Instance_C_ResetAfterErrorFocus");
static_assert(offsetof(Old_Instance_C_ResetAfterErrorFocus, PlayerController) == 0x000000, "Member 'Old_Instance_C_ResetAfterErrorFocus::PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ResetAfterErrorFocus, Widget) == 0x000008, "Member 'Old_Instance_C_ResetAfterErrorFocus::Widget' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.JoinServerSession
// 0x0120 (0x0120 - 0x0000)
struct Old_Instance_C_JoinServerSession final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	class APlayerController*                      PlayerController;                                  // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ParentRef;                                         // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowLoadingScreen_0;                               // 0x0118(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Old_Instance_C_JoinServerSession) == 0x000008, "Wrong alignment on Old_Instance_C_JoinServerSession");
static_assert(sizeof(Old_Instance_C_JoinServerSession) == 0x000120, "Wrong size on Old_Instance_C_JoinServerSession");
static_assert(offsetof(Old_Instance_C_JoinServerSession, Session) == 0x000000, "Member 'Old_Instance_C_JoinServerSession::Session' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_JoinServerSession, PlayerController) == 0x000108, "Member 'Old_Instance_C_JoinServerSession::PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_JoinServerSession, ParentRef) == 0x000110, "Member 'Old_Instance_C_JoinServerSession::ParentRef' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_JoinServerSession, ShowLoadingScreen_0) == 0x000118, "Member 'Old_Instance_C_JoinServerSession::ShowLoadingScreen_0' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.ShowLoadingScreen
// 0x0020 (0x0020 - 0x0000)
struct Old_Instance_C_ShowLoadingScreen final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Old_Instance_C_ShowLoadingScreen) == 0x000008, "Wrong alignment on Old_Instance_C_ShowLoadingScreen");
static_assert(sizeof(Old_Instance_C_ShowLoadingScreen) == 0x000020, "Wrong size on Old_Instance_C_ShowLoadingScreen");
static_assert(offsetof(Old_Instance_C_ShowLoadingScreen, PlayerController) == 0x000000, "Member 'Old_Instance_C_ShowLoadingScreen::PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_ShowLoadingScreen, Message) == 0x000008, "Member 'Old_Instance_C_ShowLoadingScreen::Message' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.JoinServerCode
// 0x0020 (0x0020 - 0x0000)
struct Old_Instance_C_JoinServerCode final
{
public:
	class FString                                 Code_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ParentRef;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Old_Instance_C_JoinServerCode) == 0x000008, "Wrong alignment on Old_Instance_C_JoinServerCode");
static_assert(sizeof(Old_Instance_C_JoinServerCode) == 0x000020, "Wrong size on Old_Instance_C_JoinServerCode");
static_assert(offsetof(Old_Instance_C_JoinServerCode, Code_0) == 0x000000, "Member 'Old_Instance_C_JoinServerCode::Code_0' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_JoinServerCode, PlayerController) == 0x000010, "Member 'Old_Instance_C_JoinServerCode::PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_JoinServerCode, ParentRef) == 0x000018, "Member 'Old_Instance_C_JoinServerCode::ParentRef' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.CreateServer
// 0x0040 (0x0040 - 0x0000)
struct Old_Instance_C_CreateServer final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                WidgetRef;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ParentRef;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPlayer;                                         // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPrivate;                                         // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ServerName;                                        // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Old_Instance_C_CreateServer) == 0x000008, "Wrong alignment on Old_Instance_C_CreateServer");
static_assert(sizeof(Old_Instance_C_CreateServer) == 0x000040, "Wrong size on Old_Instance_C_CreateServer");
static_assert(offsetof(Old_Instance_C_CreateServer, PlayerController) == 0x000000, "Member 'Old_Instance_C_CreateServer::PlayerController' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, WidgetRef) == 0x000008, "Member 'Old_Instance_C_CreateServer::WidgetRef' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, ParentRef) == 0x000010, "Member 'Old_Instance_C_CreateServer::ParentRef' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, LevelName) == 0x000018, "Member 'Old_Instance_C_CreateServer::LevelName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, MaxPlayer) == 0x000020, "Member 'Old_Instance_C_CreateServer::MaxPlayer' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, IsPrivate) == 0x000024, "Member 'Old_Instance_C_CreateServer::IsPrivate' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_CreateServer, ServerName) == 0x000028, "Member 'Old_Instance_C_CreateServer::ServerName' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.OnSuccess_ED213154495FF5E71DED67A697B987EA
// 0x0010 (0x0010 - 0x0000)
struct Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA) == 0x000004, "Wrong alignment on Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA");
static_assert(sizeof(Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA) == 0x000010, "Wrong size on Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA");
static_assert(offsetof(Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA, WrittenAchievementName) == 0x000000, "Member 'Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA, WrittenProgress) == 0x000008, "Member 'Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA::WrittenProgress' has a wrong offset!");
static_assert(offsetof(Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA, WrittenUserTag) == 0x00000C, "Member 'Old_Instance_C_OnSuccess_ED213154495FF5E71DED67A697B987EA::WrittenUserTag' has a wrong offset!");

// Function Old_Instance.Old_Instance_C.OnFailure_ED213154495FF5E71DED67A697B987EA
// 0x0010 (0x0010 - 0x0000)
