#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStats_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerStats_UI.PlayerStats_UI_C
// 0x0040 (0x02A0 - 0x0260)
class UPlayerStats_UI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                KickButton;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PingText;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Ping;                                              // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerId;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerStats_UI(int32 EntryPoint);
	void BndEvt__PlayerStats_UI_KickButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void Update_Killed();
	class FText GetPingText();
	ESlateVisibility GetKickButtonVisibility();
	void GetPlayerById(class APlayerState** PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerStats_UI_C">();
	}
	static class UPlayerStats_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStats_UI_C>();
	}
};
static_assert(alignof(UPlayerStats_UI_C) == 0x000008, "Wrong alignment on UPlayerStats_UI_C");
static_assert(sizeof(UPlayerStats_UI_C) == 0x0002A0, "Wrong size on UPlayerStats_UI_C");
static_assert(offsetof(UPlayerStats_UI_C, UberGraphFrame) == 0x000260, "Member 'UPlayerStats_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, KickButton) == 0x000268, "Member 'UPlayerStats_UI_C::KickButton' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, NameText) == 0x000270, "Member 'UPlayerStats_UI_C::NameText' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, PingText) == 0x000278, "Member 'UPlayerStats_UI_C::PingText' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, Ping) == 0x000280, "Member 'UPlayerStats_UI_C::Ping' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, Name_0) == 0x000288, "Member 'UPlayerStats_UI_C::Name_0' has a wrong offset!");
static_assert(offsetof(UPlayerStats_UI_C, PlayerId) == 0x000298, "Member 'UPlayerStats_UI_C::PlayerId' has a wrong offset!");

}

