#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Legs_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Player_Legs_AnimBP.Player_Legs_AnimBP_C.ExecuteUbergraph_Player_Legs_AnimBP
// 0x0050 (0x0050 - 0x0000)
struct Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP) == 0x000008, "Wrong alignment on Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP");
static_assert(sizeof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP) == 0x000050, "Wrong size on Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, EntryPoint) == 0x000000, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000008, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x00000D, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00000E, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000030, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_VSize_ReturnValue) == 0x00003C, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP, CallFunc_CalculateDirection_ReturnValue) == 0x00004C, "Member 'Player_Legs_AnimBP_C_ExecuteUbergraph_Player_Legs_AnimBP::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");

// Function Player_Legs_AnimBP.Player_Legs_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Player_Legs_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_Legs_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Player_Legs_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Player_Legs_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Player_Legs_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Player_Legs_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Player_Legs_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Player_Legs_AnimBP.Player_Legs_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Player_Legs_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_Legs_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Player_Legs_AnimBP_C_AnimGraph");
static_assert(sizeof(Player_Legs_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Player_Legs_AnimBP_C_AnimGraph");
static_assert(offsetof(Player_Legs_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Player_Legs_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

