#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SecurityPopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_SecurityPopup.UI_SecurityPopup_C.ExecuteUbergraph_UI_SecurityPopup
// 0x0030 (0x0030 - 0x0000)
struct UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Drag_C*                             K2Node_DynamicCast_AsUI_Drag;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup) == 0x000008, "Wrong alignment on UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup");
static_assert(sizeof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup) == 0x000030, "Wrong size on UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, EntryPoint) == 0x000000, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, CallFunc_GetParent_ReturnValue) == 0x000008, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, CallFunc_GetOuterObject_ReturnValue) == 0x000010, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, CallFunc_GetOuterObject_ReturnValue_1) == 0x000018, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, K2Node_DynamicCast_AsUI_Drag) == 0x000020, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::K2Node_DynamicCast_AsUI_Drag' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_SecurityPopup_C_ExecuteUbergraph_UI_SecurityPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UI_SecurityPopup.UI_SecurityPopup_C.CheckFont
// 0x0070 (0x0070 - 0x0000)
struct UI_SecurityPopup_C_CheckFont final
{
public:
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0000(0x0058)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_SecurityPopup_C_CheckFont) == 0x000008, "Wrong alignment on UI_SecurityPopup_C_CheckFont");
static_assert(sizeof(UI_SecurityPopup_C_CheckFont) == 0x000070, "Wrong size on UI_SecurityPopup_C_CheckFont");
static_assert(offsetof(UI_SecurityPopup_C_CheckFont, K2Node_MakeStruct_SlateFontInfo) == 0x000000, "Member 'UI_SecurityPopup_C_CheckFont::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_CheckFont, CallFunc_GetCurrentCulture_ReturnValue) == 0x000058, "Member 'UI_SecurityPopup_C_CheckFont::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SecurityPopup_C_CheckFont, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000068, "Member 'UI_SecurityPopup_C_CheckFont::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

}

