#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Confirmation

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Comfirmation_structs.hpp"


namespace SDK::Params
{

// Function W_Confirmation.W_Confirmation_C.ExecuteUbergraph_W_Confirmation
// 0x0190 (0x0190 - 0x0000)
struct W_Confirmation_C_ExecuteUbergraph_W_Confirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0020(0x0018)()
	class FText                                   K2Node_Event_Message;                              // 0x0038(0x0018)()
	E_Comfirmation                                K2Node_Event_ConfirmationFor;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00FC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUserFocus_ReturnValue_1;               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_6;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation) == 0x000008, "Wrong alignment on W_Confirmation_C_ExecuteUbergraph_W_Confirmation");
static_assert(sizeof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation) == 0x000190, "Wrong size on W_Confirmation_C_ExecuteUbergraph_W_Confirmation");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, EntryPoint) == 0x000000, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_IsClosed_Variable_1) == 0x000019, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_Has_Been_Initd_Variable_1) == 0x00001A, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_Has_Been_Initd_Variable_2) == 0x00001B, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_Event_Title) == 0x000020, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_Event_Message) == 0x000038, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_Event_ConfirmationFor) == 0x000050, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_Event_ConfirmationFor' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Conv_FloatToText_ReturnValue) == 0x000070, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C8, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_MakeArray_Array) == 0x0000D0, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_Has_Been_Initd_Variable_3) == 0x0000F8, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_IsClosed_Variable_2) == 0x0000F9, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_SwitchEnum_CmpSuccess) == 0x0000FA, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000FB, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_Event_MyGeometry) == 0x0000FC, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, K2Node_Event_InDeltaTime) == 0x000134, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, Temp_bool_IsClosed_Variable_3) == 0x000138, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue) == 0x000140, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000148, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_HasUserFocus_ReturnValue) == 0x000150, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_HasUserFocus_ReturnValue_1) == 0x000151, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_HasUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000158, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000160, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x000168, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_5) == 0x000170, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_GetOwningPlayer_ReturnValue_6) == 0x000178, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_GetOwningPlayer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_DestroySession_ReturnValue) == 0x000180, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_DestroySession_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_ExecuteUbergraph_W_Confirmation, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'W_Confirmation_C_ExecuteUbergraph_W_Confirmation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_Confirmation.W_Confirmation_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Confirmation_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Confirmation_C_Tick) == 0x000004, "Wrong alignment on W_Confirmation_C_Tick");
static_assert(sizeof(W_Confirmation_C_Tick) == 0x00003C, "Wrong size on W_Confirmation_C_Tick");
static_assert(offsetof(W_Confirmation_C_Tick, MyGeometry) == 0x000000, "Member 'W_Confirmation_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Confirmation_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Confirmation.W_Confirmation_C.UpdateConfirmation
// 0x0038 (0x0038 - 0x0000)
struct W_Confirmation_C_UpdateConfirmation final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Message;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	E_Comfirmation                                ConfirmationFor_0;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Confirmation_C_UpdateConfirmation) == 0x000008, "Wrong alignment on W_Confirmation_C_UpdateConfirmation");
static_assert(sizeof(W_Confirmation_C_UpdateConfirmation) == 0x000038, "Wrong size on W_Confirmation_C_UpdateConfirmation");
static_assert(offsetof(W_Confirmation_C_UpdateConfirmation, Title) == 0x000000, "Member 'W_Confirmation_C_UpdateConfirmation::Title' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_UpdateConfirmation, Message) == 0x000018, "Member 'W_Confirmation_C_UpdateConfirmation::Message' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_UpdateConfirmation, ConfirmationFor_0) == 0x000030, "Member 'W_Confirmation_C_UpdateConfirmation::ConfirmationFor_0' has a wrong offset!");

// Function W_Confirmation.W_Confirmation_C.CustomNavigation_Left
// 0x0028 (0x0028 - 0x0000)
struct W_Confirmation_C_CustomNavigation_Left final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Confirmation_C_CustomNavigation_Left) == 0x000008, "Wrong alignment on W_Confirmation_C_CustomNavigation_Left");
static_assert(sizeof(W_Confirmation_C_CustomNavigation_Left) == 0x000028, "Wrong size on W_Confirmation_C_CustomNavigation_Left");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Left, Navigation_0) == 0x000000, "Member 'W_Confirmation_C_CustomNavigation_Left::Navigation_0' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Left, ReturnValue) == 0x000008, "Member 'W_Confirmation_C_CustomNavigation_Left::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Left, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'W_Confirmation_C_CustomNavigation_Left::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Left, CallFunc_HasUserFocus_ReturnValue) == 0x000018, "Member 'W_Confirmation_C_CustomNavigation_Left::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Left, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'W_Confirmation_C_CustomNavigation_Left::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");

// Function W_Confirmation.W_Confirmation_C.CustomNavigation_Right
// 0x0028 (0x0028 - 0x0000)
struct W_Confirmation_C_CustomNavigation_Right final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Confirmation_C_CustomNavigation_Right) == 0x000008, "Wrong alignment on W_Confirmation_C_CustomNavigation_Right");
static_assert(sizeof(W_Confirmation_C_CustomNavigation_Right) == 0x000028, "Wrong size on W_Confirmation_C_CustomNavigation_Right");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Right, Navigation_0) == 0x000000, "Member 'W_Confirmation_C_CustomNavigation_Right::Navigation_0' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Right, ReturnValue) == 0x000008, "Member 'W_Confirmation_C_CustomNavigation_Right::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Right, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'W_Confirmation_C_CustomNavigation_Right::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Right, CallFunc_HasUserFocus_ReturnValue) == 0x000018, "Member 'W_Confirmation_C_CustomNavigation_Right::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_CustomNavigation_Right, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'W_Confirmation_C_CustomNavigation_Right::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");

// Function W_Confirmation.W_Confirmation_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct W_Confirmation_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(W_Confirmation_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on W_Confirmation_C_OnMouseButtonUp");
static_assert(sizeof(W_Confirmation_C_OnMouseButtonUp) == 0x000218, "Wrong size on W_Confirmation_C_OnMouseButtonUp");
static_assert(offsetof(W_Confirmation_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'W_Confirmation_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'W_Confirmation_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'W_Confirmation_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Confirmation_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'W_Confirmation_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

