#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_LoadingScreen.W_LoadingScreen_C.ExecuteUbergraph_W_LoadingScreen
// 0x0110 (0x0110 - 0x0000)
struct W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0050(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_1; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x00F8(0x0018)()
};
static_assert(alignof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen) == 0x000008, "Wrong alignment on W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen");
static_assert(sizeof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen) == 0x000110, "Wrong size on W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, EntryPoint) == 0x000000, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x000004, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_bool_Variable) == 0x000018, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable) == 0x000020, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_bool_Variable_1) == 0x000038, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_bool_Variable_2) == 0x000039, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_byte_Variable) == 0x00003A, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_byte_Variable_1) == 0x00003B, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_MakeArray_Array) == 0x000040, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Format_ReturnValue) == 0x000050, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Array_LastIndex_ReturnValue) == 0x000078, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00007C, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Array_Get_Item) == 0x000090, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Len_ReturnValue) == 0x0000A8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Select_Default) == 0x0000B0, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_1) == 0x0000D0, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000D8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Len_ReturnValue_1) == 0x0000EC, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000F0, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Select_Default_1) == 0x0000F2, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Select_Default_2) == 0x0000F8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Select_Default_2' has a wrong offset!");

// Function W_LoadingScreen.W_LoadingScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_LoadingScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_LoadingScreen_C_PreConstruct) == 0x000001, "Wrong alignment on W_LoadingScreen_C_PreConstruct");
static_assert(sizeof(W_LoadingScreen_C_PreConstruct) == 0x000001, "Wrong size on W_LoadingScreen_C_PreConstruct");
static_assert(offsetof(W_LoadingScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_LoadingScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

