#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water_Ripple_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FluidForceDynamic_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Water_Ripple_Component.Water_Ripple_Component_C
// 0x0080 (0x0130 - 0x00B0)
class UWater_Ripple_Component_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFluidForceDynamic                     FluidForceDynamic_Settings;                        // 0x00B8(0x0070)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class ABP_FluidSim_01_C*                      Sim;                                               // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Water_Ripple_Component(int32 EntryPoint);
	void Cast();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Water_Ripple_Component_C">();
	}
	static class UWater_Ripple_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWater_Ripple_Component_C>();
	}
};
static_assert(alignof(UWater_Ripple_Component_C) == 0x000008, "Wrong alignment on UWater_Ripple_Component_C");
static_assert(sizeof(UWater_Ripple_Component_C) == 0x000130, "Wrong size on UWater_Ripple_Component_C");
static_assert(offsetof(UWater_Ripple_Component_C, UberGraphFrame) == 0x0000B0, "Member 'UWater_Ripple_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWater_Ripple_Component_C, FluidForceDynamic_Settings) == 0x0000B8, "Member 'UWater_Ripple_Component_C::FluidForceDynamic_Settings' has a wrong offset!");
static_assert(offsetof(UWater_Ripple_Component_C, Sim) == 0x000128, "Member 'UWater_Ripple_Component_C::Sim' has a wrong offset!");

}

