#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Computer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Backrooms_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Computer.BP_Computer_C
// 0x0040 (0x0320 - 0x02E0)
class ABP_Computer_C final : public AInteractablePawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetInteractionComponent*            WidgetInteraction2;                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetInteractionComponent*            WidgetInteraction1;                                // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetInteractionComponent*            WidgetInteraction;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Screen;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUse;                                            // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UpdateLogin;                                       // 0x0309(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      LeftBeam;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightBeam;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Computer(int32 EntryPoint);
	void ToggleScreen(bool IsHidden);
	void OnVRPossess(bool bPossess);
	void ReceiveBeginPlay();
	void SetActivated();
	void InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_1(float AxisValue);
	void UnPossess();
	void OnPossess();
	void ReceivePossessed(class AController* NewController);
	void InpActEvt_Use_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_Use_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_Interact_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void OnRep_UpdateLogin();
	void ToggleWidgetInteraction(bool Enable);
	void Update_Beam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Computer_C">();
	}
	static class ABP_Computer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Computer_C>();
	}
};
static_assert(alignof(ABP_Computer_C) == 0x000008, "Wrong alignment on ABP_Computer_C");
static_assert(sizeof(ABP_Computer_C) == 0x000320, "Wrong size on ABP_Computer_C");
static_assert(offsetof(ABP_Computer_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_Computer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, WidgetInteraction2) == 0x0002E8, "Member 'ABP_Computer_C::WidgetInteraction2' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, WidgetInteraction1) == 0x0002F0, "Member 'ABP_Computer_C::WidgetInteraction1' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, WidgetInteraction) == 0x0002F8, "Member 'ABP_Computer_C::WidgetInteraction' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, Screen) == 0x000300, "Member 'ABP_Computer_C::Screen' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, CanUse) == 0x000308, "Member 'ABP_Computer_C::CanUse' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, UpdateLogin) == 0x000309, "Member 'ABP_Computer_C::UpdateLogin' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, LeftBeam) == 0x000310, "Member 'ABP_Computer_C::LeftBeam' has a wrong offset!");
static_assert(offsetof(ABP_Computer_C, RightBeam) == 0x000318, "Member 'ABP_Computer_C::RightBeam' has a wrong offset!");

}

