#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireworkProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FireworkProjectile.BP_FireworkProjectile_C.ExecuteUbergraph_BP_FireworkProjectile
// 0x00F8 (0x00F8 - 0x0000)
struct BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile) == 0x000008, "Wrong alignment on BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile");
static_assert(sizeof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile) == 0x0000F8, "Wrong size on BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, EntryPoint) == 0x000000, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, Temp_object_Variable) == 0x000008, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000040, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SphereOverlapActors_OutActors) == 0x000070, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SphereOverlapActors_ReturnValue) == 0x000080, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000098, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_HasAuthority_ReturnValue) == 0x0000A8, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000B0, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000C4, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D0, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000D8, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0000E0, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_FireworkProjectile_C_ExecuteUbergraph_BP_FireworkProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

}

