#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_AlmondWater

#include "Basic.hpp"

#include "BP_Item_classes.hpp"
#include "Engine_structs.hpp"
#include "Backrooms_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_AlmondWater.BP_Item_AlmondWater_C
// 0x0010 (0x0268 - 0x0258)
class ABP_Item_AlmondWater_C final : public ABP_Item_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Item_AlmondWater_C;              // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HalloweenMat;                                      // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnabledFOV;                                        // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Item_AlmondWater(int32 EntryPoint);
	void Damage_SERVER(class UObject* Target, class AFancyCharacter* Character);
	void PlayAnimation();
	void OnCompleted_3881A8424F905F4C29433AB5756CB3DA(class FName NotifyName);
	void OnBlendOut_3881A8424F905F4C29433AB5756CB3DA(class FName NotifyName);
	void OnInterrupted_3881A8424F905F4C29433AB5756CB3DA(class FName NotifyName);
	void OnNotifyBegin_3881A8424F905F4C29433AB5756CB3DA(class FName NotifyName);
	void OnNotifyEnd_3881A8424F905F4C29433AB5756CB3DA(class FName NotifyName);
	void OnEventLoaded(EEventType EventType);
	void ToggleEvent(bool Enable);
	void UseItem();
	void SetMaterial(bool EnabledFOV_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Item_AlmondWater_C">();
	}
	static class ABP_Item_AlmondWater_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_AlmondWater_C>();
	}
};
static_assert(alignof(ABP_Item_AlmondWater_C) == 0x000008, "Wrong alignment on ABP_Item_AlmondWater_C");
static_assert(sizeof(ABP_Item_AlmondWater_C) == 0x000268, "Wrong size on ABP_Item_AlmondWater_C");
static_assert(offsetof(ABP_Item_AlmondWater_C, UberGraphFrame_BP_Item_AlmondWater_C) == 0x000258, "Member 'ABP_Item_AlmondWater_C::UberGraphFrame_BP_Item_AlmondWater_C' has a wrong offset!");
static_assert(offsetof(ABP_Item_AlmondWater_C, HalloweenMat) == 0x000260, "Member 'ABP_Item_AlmondWater_C::HalloweenMat' has a wrong offset!");
static_assert(offsetof(ABP_Item_AlmondWater_C, EnabledFOV) == 0x000261, "Member 'ABP_Item_AlmondWater_C::EnabledFOV' has a wrong offset!");

}

