#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ocean_Manager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_Ocean_Manager.BP_Ocean_Manager_C.ExecuteUbergraph_BP_Ocean_Manager
// 0x0150 (0x0150 - 0x0000)
struct BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEight_FFT_H_Ocean_Sim_C*               CallFunc_GetActorOfClass_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEight_FFT_H_Ocean_Sim_C*               CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Fish_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_RowBoat_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0130(0x0010)(ReferenceParm)
	class ABP_RowBoat_C*                          CallFunc_Array_Random_OutItem;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager) == 0x000010, "Wrong alignment on BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager");
static_assert(sizeof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager) == 0x000150, "Wrong size on BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, EntryPoint) == 0x000000, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_IsClosed_Variable_1) == 0x000005, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_IsClosed_Variable_2) == 0x00000D, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_Has_Been_Initd_Variable_1) == 0x00000E, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000020, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetActorOfClass_ReturnValue) == 0x000028, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000032, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000038, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_Has_Been_Initd_Variable_2) == 0x000041, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_IsClosed_Variable_3) == 0x000042, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, Temp_bool_Has_Been_Initd_Variable_3) == 0x000043, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, K2Node_CustomEvent_Location) == 0x000044, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000050, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000058, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, K2Node_CustomEvent_QueryInstance) == 0x000060, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, K2Node_CustomEvent_QueryStatus) == 0x000068, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_RunEQSQuery_ReturnValue) == 0x000070, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x000080, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x000090, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_Array_Get_Item) == 0x000094, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_BreakVector_X) == 0x0000A0, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_MakeVector_ReturnValue) == 0x0000AC, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_IsOverlappingActor_ReturnValue) == 0x000110, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000114, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000130, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_Array_Random_OutItem) == 0x000140, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager, CallFunc_Array_Random_OutIndex) == 0x000148, "Member 'BP_Ocean_Manager_C_ExecuteUbergraph_BP_Ocean_Manager::CallFunc_Array_Random_OutIndex' has a wrong offset!");

// Function BP_Ocean_Manager.BP_Ocean_Manager_C.OnSpawn
// 0x0010 (0x0010 - 0x0000)
struct BP_Ocean_Manager_C_OnSpawn final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ocean_Manager_C_OnSpawn) == 0x000008, "Wrong alignment on BP_Ocean_Manager_C_OnSpawn");
static_assert(sizeof(BP_Ocean_Manager_C_OnSpawn) == 0x000010, "Wrong size on BP_Ocean_Manager_C_OnSpawn");
static_assert(offsetof(BP_Ocean_Manager_C_OnSpawn, QueryInstance) == 0x000000, "Member 'BP_Ocean_Manager_C_OnSpawn::QueryInstance' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_OnSpawn, QueryStatus) == 0x000008, "Member 'BP_Ocean_Manager_C_OnSpawn::QueryStatus' has a wrong offset!");

// Function BP_Ocean_Manager.BP_Ocean_Manager_C.MC_PlayWarning
// 0x000C (0x000C - 0x0000)
struct BP_Ocean_Manager_C_MC_PlayWarning final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ocean_Manager_C_MC_PlayWarning) == 0x000004, "Wrong alignment on BP_Ocean_Manager_C_MC_PlayWarning");
static_assert(sizeof(BP_Ocean_Manager_C_MC_PlayWarning) == 0x00000C, "Wrong size on BP_Ocean_Manager_C_MC_PlayWarning");
static_assert(offsetof(BP_Ocean_Manager_C_MC_PlayWarning, Location) == 0x000000, "Member 'BP_Ocean_Manager_C_MC_PlayWarning::Location' has a wrong offset!");

// Function BP_Ocean_Manager.BP_Ocean_Manager_C.UpdateBuoyancy
// 0x0020 (0x0020 - 0x0000)
struct BP_Ocean_Manager_C_UpdateBuoyancy final
{
public:
	bool                                          Rising;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RowBoat_C*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ocean_Manager_C_UpdateBuoyancy) == 0x000008, "Wrong alignment on BP_Ocean_Manager_C_UpdateBuoyancy");
static_assert(sizeof(BP_Ocean_Manager_C_UpdateBuoyancy) == 0x000020, "Wrong size on BP_Ocean_Manager_C_UpdateBuoyancy");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, Rising) == 0x000000, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::Rising' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateBuoyancy, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Ocean_Manager_C_UpdateBuoyancy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Ocean_Manager.BP_Ocean_Manager_C.UpdateDrowning
// 0x0040 (0x0040 - 0x0000)
struct BP_Ocean_Manager_C_UpdateDrowning final
{
public:
	bool                                          Rising;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_GameState_C*                        K2Node_DynamicCast_AsMP_Game_State;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_Swimming_C*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ocean_Manager_C_UpdateDrowning) == 0x000008, "Wrong alignment on BP_Ocean_Manager_C_UpdateDrowning");
static_assert(sizeof(BP_Ocean_Manager_C_UpdateDrowning) == 0x000040, "Wrong size on BP_Ocean_Manager_C_UpdateDrowning");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateDrowning, Rising) == 0x000000, "Member 'BP_Ocean_Manager_C_UpdateDrowning::Rising' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateDrowning, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Ocean_Manager_C_UpdateDrowning::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ocean_Manager_C_UpdateDrowning, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Ocean_Manager_C_UpdateDrowning::Temp_int_Loop_Counter_Variable' has a wrong offset!");
