#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rope

#include "Basic.hpp"

#include "BP_Item_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rope.BP_Rope_C
// 0x0030 (0x0288 - 0x0258)
class ABP_Rope_C final : public ABP_Item_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Rope_C;                          // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCableComponent*                        Cable;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        LastDecal;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RopeZone_C*                         RopeZone;                                          // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsing;                                           // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Rope(int32 EntryPoint);
	void RemoveRope();
	void SRV_ShowRope(class AActor* Actor, const struct FVector& Location);
	void SRV_HideRope();
	void ReceiveDestroyed();
	void OC_ShowRope(class AActor* Actor, const struct FVector& Location);
	void SRV_TossRope(class ABP_Rope_Floor_C* Floor, const struct FVector& Impact);
	void OC_Trace();
	void OC_HideRope();
	void MC_Throw();
	void OnCompleted_6D75097146D9F446056AF481A6C55D82(class FName NotifyName);
	void OnBlendOut_6D75097146D9F446056AF481A6C55D82(class FName NotifyName);
	void OnInterrupted_6D75097146D9F446056AF481A6C55D82(class FName NotifyName);
	void OnNotifyBegin_6D75097146D9F446056AF481A6C55D82(class FName NotifyName);
	void OnNotifyEnd_6D75097146D9F446056AF481A6C55D82(class FName NotifyName);
	void UseItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Rope_C">();
	}
	static class ABP_Rope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rope_C>();
	}
};
static_assert(alignof(ABP_Rope_C) == 0x000008, "Wrong alignment on ABP_Rope_C");
static_assert(sizeof(ABP_Rope_C) == 0x000288, "Wrong size on ABP_Rope_C");
static_assert(offsetof(ABP_Rope_C, UberGraphFrame_BP_Rope_C) == 0x000258, "Member 'ABP_Rope_C::UberGraphFrame_BP_Rope_C' has a wrong offset!");
static_assert(offsetof(ABP_Rope_C, Cable) == 0x000260, "Member 'ABP_Rope_C::Cable' has a wrong offset!");
static_assert(offsetof(ABP_Rope_C, Arrow) == 0x000268, "Member 'ABP_Rope_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Rope_C, LastDecal) == 0x000270, "Member 'ABP_Rope_C::LastDecal' has a wrong offset!");
static_assert(offsetof(ABP_Rope_C, RopeZone) == 0x000278, "Member 'ABP_Rope_C::RopeZone' has a wrong offset!");
static_assert(offsetof(ABP_Rope_C, IsUsing) == 0x000280, "Member 'ABP_Rope_C::IsUsing' has a wrong offset!");

}

