#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RowBoat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_RowBoat.BP_RowBoat_C.ExecuteUbergraph_BP_RowBoat
// 0x0CD0 (0x0CD0 - 0x0000)
struct BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FInterpEaseInOut_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_7;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_6;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_5;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_4;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x00B0(0x0028)()
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1; // 0x0178(0x0028)()
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Fish_C*                             CallFunc_GetActorOfClass_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDefaultLevelSequenceInstanceData*      K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0xF];                                      // 0x01C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x01D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor_1;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue_1;  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class UDefaultLevelSequenceInstanceData*      K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data_1; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Fish_C*                             CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_StartRot;                       // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_CustomEvent_EndRot;                         // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0314(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x03A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_3;    // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x0460(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_3;     // 0x04E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x057C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_1;  // 0x0610(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_4;     // 0x06A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_6;                // 0x074C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_7;                // 0x0758(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0764(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x07EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_874[0x4];                                      // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_881[0x7];                                      // 0x0881(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_OldController;                        // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89A[0x6];                                      // 0x089A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x08A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x3];                                      // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Random_OutItem;                     // 0x08BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x08D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x08E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ED[0x3];                                      // 0x08ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x08F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x08FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0900(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0910(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_919[0x3];                                      // 0x0919(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_6;                      // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_6;                     // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_6;                       // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_8;                // 0x0928(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_9;                // 0x0934(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0940(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_RotatorToString_ReturnValue;         // 0x09C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x09D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x09E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAC_Swimming_C*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x09F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_1;              // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x09F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FA[0x6];                                      // 0x09FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0A09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0A0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A0B[0x1];                                      // 0x0A0B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0A0C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0A18(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_7;                      // 0x0A24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_7;                     // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_7;                       // 0x0A2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_10;               // 0x0A30(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0A3C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_3;                     // 0x0A4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_8;                      // 0x0A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_8;                     // 0x0A54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_8;                       // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_11;               // 0x0A5C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue_4;                     // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_2;  // 0x0A6C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_12;               // 0x0AF4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0B00(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_9;                      // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_9;                     // 0x0B8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_9;                       // 0x0B90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x0B94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_5;                     // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0B9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_13;               // 0x0BA0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_14;               // 0x0BAC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_4;  // 0x0BB8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_3;  // 0x0C40(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat) == 0x000010, "Wrong alignment on BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat");
static_assert(sizeof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat) == 0x000CD0, "Wrong size on BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, EntryPoint) == 0x000000, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputAxisEvent_AxisValue) == 0x000004, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputActionEvent_Key) == 0x000008, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FInterpEaseInOut_ReturnValue) == 0x000030, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FInterpEaseInOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Lerp_ReturnValue) == 0x000034, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_HasAuthority_ReturnValue) == 0x000039, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputAxisEvent_AxisValue_7) == 0x00003C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputAxisEvent_AxisValue_7' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputAxisEvent_AxisValue_6) == 0x000040, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputAxisEvent_AxisValue_6' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue) == 0x00004C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_1) == 0x000058, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000064, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputAxisEvent_AxisValue_5) == 0x000068, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputAxisEvent_AxisValue_5' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_InputAxisEvent_AxisValue_4) == 0x00006C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_InputAxisEvent_AxisValue_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetActorForwardVector_ReturnValue) == 0x000070, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetControlRotation_ReturnValue) == 0x00007C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll) == 0x000088, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch) == 0x00008C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw) == 0x000090, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_2) == 0x000094, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetForwardVector_ReturnValue) == 0x0000A0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x0000B0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetTransform_ReturnValue) == 0x0000E0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Location) == 0x000110, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Rotation) == 0x00011C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Scale) == 0x000128, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000134, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000170, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1) == 0x000178, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x0001A0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x0001A8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetActorOfClass_ReturnValue) == 0x0001B0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data) == 0x0001B8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetTransform_ReturnValue_1) == 0x0001D0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_CreateLevelSequencePlayer_OutActor_1) == 0x000200, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_CreateLevelSequencePlayer_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_CreateLevelSequencePlayer_ReturnValue_1) == 0x000208, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_CreateLevelSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Location_1) == 0x000210, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Rotation_1) == 0x00021C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakTransform_Scale_1) == 0x000228, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeTransform_ReturnValue_1) == 0x000240, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data_1) == 0x000270, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_DynamicCast_bSuccess_1) == 0x000278, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000280, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CustomEvent_Mesh) == 0x000288, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000290, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Add_VectorVector_ReturnValue) == 0x00029C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CustomEvent_StartRot) == 0x0002A8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CustomEvent_StartRot' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CustomEvent_EndRot) == 0x0002B4, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CustomEvent_EndRot' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_RLerp_ReturnValue) == 0x0002C0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002CC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0002D0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0002DC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_1) == 0x0002E0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_1) == 0x0002E4, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_1) == 0x0002E8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0002EC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0002F0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_3) == 0x0002FC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_2) == 0x000308, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_2) == 0x00030C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_2) == 0x000310, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000314, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_4) == 0x00039C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0003A8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentRotation_ReturnValue_2) == 0x000430, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_3) == 0x00043C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_3) == 0x000440, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_3) == 0x000444, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentRotation_ReturnValue_3) == 0x000448, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_5) == 0x000454, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetWorldRotation_SweepHitResult_2) == 0x000460, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetWorldRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetWorldRotation_SweepHitResult_3) == 0x0004E8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetWorldRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000570, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x00057C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FindLookAtRotation_ReturnValue) == 0x000604, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_AddRelativeRotation_SweepHitResult_1) == 0x000610, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_AddRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_RInterpTo_ReturnValue) == 0x000698, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetWorldRotation_SweepHitResult_4) == 0x0006A4, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetWorldRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_4) == 0x00072C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_4) == 0x000730, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_4) == 0x000734, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_5) == 0x000738, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_5' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_5) == 0x00073C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_5' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_5) == 0x000740, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_5' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FClamp_ReturnValue_1) == 0x000744, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FClamp_ReturnValue_2) == 0x000748, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_6) == 0x00074C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_7) == 0x000758, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000764, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0007EC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_Event_NewController) == 0x000878, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_Event_NewController' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_IsLocallyControlled_ReturnValue) == 0x000880, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_Event_OldController) == 0x000888, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_Event_OldController' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CustomEvent_QueryInstance) == 0x000890, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CustomEvent_QueryStatus) == 0x000898, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000899, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_RunEQSQuery_ReturnValue) == 0x0008A0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x0008A8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x0008B8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Array_Random_OutItem) == 0x0008BC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Array_Random_OutIndex) == 0x0008C8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Array_Length_ReturnValue) == 0x0008CC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Conv_IntToString_ReturnValue) == 0x0008D0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0008E0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, Temp_bool_Has_Been_Initd_Variable) == 0x0008EC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0008F0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_TeleportTo_ReturnValue) == 0x0008FC, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, K2Node_CreateDelegate_OutputDelegate_1) == 0x000900, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000910, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000918, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Roll_6) == 0x00091C, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Roll_6' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Pitch_6) == 0x000920, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Pitch_6' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_BreakRotator_Yaw_6) == 0x000924, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_BreakRotator_Yaw_6' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_8) == 0x000928, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_MakeRotator_ReturnValue_9) == 0x000934, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_MakeRotator_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000940, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_Conv_RotatorToString_ReturnValue) == 0x0009C8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_Conv_RotatorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0009D8, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0009E4, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat, CallFunc_GetComponentByClass_ReturnValue) == 0x0009F0, "Member 'BP_RowBoat_C_ExecuteUbergraph_BP_RowBoat::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
