#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WalkieTalkie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.ExecuteUbergraph_BP_WalkieTalkie
// 0x0210 (0x0210 - 0x0000)
struct BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo_1;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0xF];                                      // 0x0141(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WalkieTalkie_Display_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_DynamicCast_AsFancy_Character;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_DynamicCast_AsFancy_Character_1;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie) == 0x000010, "Wrong alignment on BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie");
static_assert(sizeof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie) == 0x000210, "Wrong size on BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, EntryPoint) == 0x000000, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_9) == 0x000010, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_8) == 0x000028, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_7) == 0x000040, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_6) == 0x000058, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_5) == 0x000070, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, Temp_name_Variable) == 0x000088, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_5) == 0x000090, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_4) == 0x0000A0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_3) == 0x0000A8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_2) == 0x0000C0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName_1) == 0x0000D8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CustomEvent_NotifyName) == 0x0000F0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000F8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, Temp_name_Variable_1) == 0x000108, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000110, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_GetOwner_ReturnValue) == 0x000118, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_GetOwner_ReturnValue_1) == 0x000120, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000128, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_AsBPCharacter_Demo_1) == 0x000138, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_AsBPCharacter_Demo_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_GetOwner_ReturnValue_2) == 0x000180, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000188, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_FinishSpawningActor_ReturnValue) == 0x000190, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_Subtract_IntInt_ReturnValue) == 0x000198, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_GetOwner_ReturnValue_3) == 0x0001A0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_AsFancy_Character) == 0x0001A8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_AsFancy_Character' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001B8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001C0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001C8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_IsValid_ReturnValue) == 0x0001C9, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0001D0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_GetOwner_ReturnValue_4) == 0x0001D8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_AsFancy_Character_1) == 0x0001E0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_AsFancy_Character_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, K2Node_DynamicCast_bSuccess_3) == 0x0001E8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001E9, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0001F0, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000200, "Member 'BP_WalkieTalkie_C_ExecuteUbergraph_BP_WalkieTalkie::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnCompleted_F5534A844701AD21AB1B749705B92259
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259");
static_assert(sizeof(BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259");
static_assert(offsetof(BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnCompleted_F5534A844701AD21AB1B749705B92259::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnBlendOut_F5534A844701AD21AB1B749705B92259
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259");
static_assert(sizeof(BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259");
static_assert(offsetof(BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnBlendOut_F5534A844701AD21AB1B749705B92259::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnInterrupted_F5534A844701AD21AB1B749705B92259
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259");
static_assert(sizeof(BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259");
static_assert(offsetof(BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnInterrupted_F5534A844701AD21AB1B749705B92259::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnNotifyBegin_F5534A844701AD21AB1B749705B92259
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259");
static_assert(sizeof(BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259");
static_assert(offsetof(BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnNotifyBegin_F5534A844701AD21AB1B749705B92259::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnNotifyEnd_F5534A844701AD21AB1B749705B92259
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259");
static_assert(sizeof(BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259");
static_assert(offsetof(BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnNotifyEnd_F5534A844701AD21AB1B749705B92259::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnCompleted_0A19368B42B332B8561A4A9702E5897B
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B");
static_assert(sizeof(BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B");
static_assert(offsetof(BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnCompleted_0A19368B42B332B8561A4A9702E5897B::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnBlendOut_0A19368B42B332B8561A4A9702E5897B
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B");
static_assert(sizeof(BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B");
static_assert(offsetof(BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnBlendOut_0A19368B42B332B8561A4A9702E5897B::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnInterrupted_0A19368B42B332B8561A4A9702E5897B
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B");
static_assert(sizeof(BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B");
static_assert(offsetof(BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnInterrupted_0A19368B42B332B8561A4A9702E5897B::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B");
static_assert(sizeof(BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B");
static_assert(offsetof(BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnNotifyBegin_0A19368B42B332B8561A4A9702E5897B::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B
// 0x0008 (0x0008 - 0x0000)
struct BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B");
static_assert(sizeof(BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B) == 0x000008, "Wrong size on BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B");
static_assert(offsetof(BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B, NotifyName) == 0x000000, "Member 'BP_WalkieTalkie_C_OnNotifyEnd_0A19368B42B332B8561A4A9702E5897B::NotifyName' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.ResetAlarm
// 0x0018 (0x0018 - 0x0000)
struct BP_WalkieTalkie_C_ResetAlarm final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFancyCharacter*                        K2Node_DynamicCast_AsFancy_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WalkieTalkie_C_ResetAlarm) == 0x000008, "Wrong alignment on BP_WalkieTalkie_C_ResetAlarm");
static_assert(sizeof(BP_WalkieTalkie_C_ResetAlarm) == 0x000018, "Wrong size on BP_WalkieTalkie_C_ResetAlarm");
static_assert(offsetof(BP_WalkieTalkie_C_ResetAlarm, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_WalkieTalkie_C_ResetAlarm::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ResetAlarm, K2Node_DynamicCast_AsFancy_Character) == 0x000008, "Member 'BP_WalkieTalkie_C_ResetAlarm::K2Node_DynamicCast_AsFancy_Character' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_ResetAlarm, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_WalkieTalkie_C_ResetAlarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.OnRep_NumConnected
// 0x0018 (0x0018 - 0x0000)
struct BP_WalkieTalkie_C_OnRep_NumConnected final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WalkieTalkie_C_OnRep_NumConnected) == 0x000008, "Wrong alignment on BP_WalkieTalkie_C_OnRep_NumConnected");
static_assert(sizeof(BP_WalkieTalkie_C_OnRep_NumConnected) == 0x000018, "Wrong size on BP_WalkieTalkie_C_OnRep_NumConnected");
static_assert(offsetof(BP_WalkieTalkie_C_OnRep_NumConnected, CallFunc_Conv_IntToString_ReturnValue) == 0x000000, "Member 'BP_WalkieTalkie_C_OnRep_NumConnected::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_OnRep_NumConnected, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WalkieTalkie_C_OnRep_NumConnected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.ActivateRadio
// 0x0004 (0x0004 - 0x0000)
struct BP_WalkieTalkie_C_ActivateRadio final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WalkieTalkie_C_ActivateRadio) == 0x000004, "Wrong alignment on BP_WalkieTalkie_C_ActivateRadio");
static_assert(sizeof(BP_WalkieTalkie_C_ActivateRadio) == 0x000004, "Wrong size on BP_WalkieTalkie_C_ActivateRadio");
static_assert(offsetof(BP_WalkieTalkie_C_ActivateRadio, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_WalkieTalkie_C_ActivateRadio::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WalkieTalkie.BP_WalkieTalkie_C.SetMaterial
// 0x0048 (0x0048 - 0x0000)
struct BP_WalkieTalkie_C_SetMaterial final
{
public:
	bool                                          EnabledFOV;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WalkieTalkie_Display_C*             K2Node_DynamicCast_AsBP_Walkie_Talkie_Display;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WalkieTalkie_C_SetMaterial) == 0x000008, "Wrong alignment on BP_WalkieTalkie_C_SetMaterial");
static_assert(sizeof(BP_WalkieTalkie_C_SetMaterial) == 0x000048, "Wrong size on BP_WalkieTalkie_C_SetMaterial");
static_assert(offsetof(BP_WalkieTalkie_C_SetMaterial, EnabledFOV) == 0x000000, "Member 'BP_WalkieTalkie_C_SetMaterial::EnabledFOV' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_SetMaterial, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WalkieTalkie_C_SetMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WalkieTalkie_C_SetMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WalkieTalkie_C_SetMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
