#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEnd_UI_2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GameEnd_UI_2.GameEnd_UI_2_C.ExecuteUbergraph_GameEnd_UI_2
// 0x0108 (0x0108 - 0x0000)
struct GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_GameState_C*                        K2Node_DynamicCast_AsMP_Game_State;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMP_GameState_C*                        K2Node_DynamicCast_AsMP_Game_State_1;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2) == 0x000008, "Wrong alignment on GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2");
static_assert(sizeof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2) == 0x000108, "Wrong size on GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, EntryPoint) == 0x000000, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_OpenSource_ReturnValue) == 0x000060, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000080, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000084, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_AsMP_Player_Controller) == 0x000098, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_AsMP_Player_Controller' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_GetGameState_ReturnValue) == 0x0000A8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B4, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_IsStandalone_ReturnValue) == 0x0000B5, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000B8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x0000C0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_GetGameState_ReturnValue_1) == 0x0000D8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_GetGameState_ReturnValue_2) == 0x0000E0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_AsMP_Game_State) == 0x0000E8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_AsMP_Game_State' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_AsMP_Game_State_1) == 0x0000F8, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_AsMP_Game_State_1' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000101, "Member 'GameEnd_UI_2_C_ExecuteUbergraph_GameEnd_UI_2::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function GameEnd_UI_2.GameEnd_UI_2_C.GetTime
// 0x0048 (0x0048 - 0x0000)
struct GameEnd_UI_2_C_GetTime final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(GameEnd_UI_2_C_GetTime) == 0x000008, "Wrong alignment on GameEnd_UI_2_C_GetTime");
static_assert(sizeof(GameEnd_UI_2_C_GetTime) == 0x000048, "Wrong size on GameEnd_UI_2_C_GetTime");
static_assert(offsetof(GameEnd_UI_2_C_GetTime, ReturnValue) == 0x000000, "Member 'GameEnd_UI_2_C_GetTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_GetTime, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'GameEnd_UI_2_C_GetTime::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_GetTime, CallFunc_Conv_FloatToString_ReturnValue) == 0x000020, "Member 'GameEnd_UI_2_C_GetTime::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameEnd_UI_2_C_GetTime, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'GameEnd_UI_2_C_GetTime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

