#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MP_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "HE_SubtitleSeq_structs.hpp"
#include "Backrooms_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HE_Subtitle_structs.hpp"


namespace SDK::Params
{

// Function MP_PlayerController.MP_PlayerController_C.ExecuteUbergraph_MP_PlayerController
// 0x0830 (0x0830 - 0x0000)
struct MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0008(0x0018)(HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_ComponentBoundEvent_VoiceData;              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_ComponentBoundEvent_MicLevel;               // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_CustomEvent_CompressedVoiceData;            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_bUseRadio_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsUnderwater_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_CustomEvent_Player;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_CustomEvent_Voice;                          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_bUseRadio;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsUnderwater;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsTearingDown_isTearingDown;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanTalk_CanTalk;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitVoice_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUsingRadio_UsingRadio;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUsingRadio_UsingRadio_1;               // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUsingPushToTalk_UsingPushToTalk;       // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUsingPushToTalk_UsingPushToTalk_1;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   CallFunc_GetPlayerStateArray_ReturnValue;          // 0x00D8(0x0010)(ReferenceParm)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubtitleWB_C*                          CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractablePawn*                      K2Node_DynamicCast_AsInteractable_Pawn;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo_1;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Spectating;                     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_GameState_C*                        K2Node_DynamicCast_AsMP_Game_State;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MyGameInstance_C*                   K2Node_DynamicCast_AsBP_My_Game_Instance;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Spectator_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameEnd_UI_2_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0220(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UGameEnd_UI_2_C*                        CallFunc_Array_Get_Item_2;                         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameEnd_UI_2_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0240(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Pressed;                        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameEnd_UI_2_C*                        CallFunc_Array_Get_Item_3;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerState*>                   CallFunc_GetPlayerStateArray_ReturnValue_1;        // 0x0270(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0290(0x0018)(HasGetValueTypeHash)
	class UPlayerStats_UI_C*                      CallFunc_Create_ReturnValue_1;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHE_SubtitleSeq                        K2Node_CustomEvent_Subtitle_1;                     // 0x02C0(0x0018)(HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x02F8(0x0018)(HasGetValueTypeHash)
	class AMP_GameState_C*                        K2Node_DynamicCast_AsMP_Game_State_1;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MyGameInstance_C*                   K2Node_DynamicCast_AsBP_My_Game_Instance_1;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LoadingScreen_C*                    CallFunc_Create_ReturnValue_2;                     // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue_1;             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue_1;               // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x5];                                      // 0x0383(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0388(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_4;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTearingDown_isTearingDown_1;         // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A7[0x1];                                      // 0x03A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHE_Subtitle                           K2Node_MakeStruct_HE_Subtitle;                     // 0x03B0(0x0050)(HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item_5;                         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHE_Subtitle>                   K2Node_MakeArray_Array;                            // 0x0408(0x0010)(ReferenceParm)
	struct FHE_SubtitleSeq                        K2Node_MakeStruct_HE_SubtitleSeq;                  // 0x0418(0x0018)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller_1;       // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractablePawn*                      K2Node_DynamicCast_AsInteractable_Pawn_1;          // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo_2;           // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller_2;       // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo_3;           // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_1; // 0x04BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHE_SubtitleSeq                        K2Node_CustomEvent_Subtitle;                       // 0x04C0(0x0018)(HasGetValueTypeHash)
	struct FHE_Subtitle                           CallFunc_Array_Get_Item_6;                         // 0x04D8(0x0050)(HasGetValueTypeHash)
	struct FHE_Subtitle                           CallFunc_Array_Get_Item_7;                         // 0x0528(0x0050)(HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVRCharacter_Demo_C*                    K2Node_DynamicCast_AsVRCharacter_Demo;             // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A[0x6];                                      // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SettingsPanel_Theme2_C*             CallFunc_Create_ReturnValue_3;                     // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpectator_UI_C*                        CallFunc_Create_ReturnValue_4;                     // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameEnd_UI_C*                          CallFunc_Create_ReturnValue_5;                     // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x05C0(0x0030)(IsPlainOldData, NoDestructor)
	class USubtitleWB_C*                          CallFunc_Create_ReturnValue_6;                     // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0600(0x0030)(IsPlainOldData, NoDestructor)
	class UWidgetComponent*                       CallFunc_AddComponentByClass_ReturnValue;          // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHE_Subtitle                           K2Node_MakeStruct_HE_Subtitle_1;                   // 0x0640(0x0050)(HasGetValueTypeHash)
	TArray<struct FHE_Subtitle>                   K2Node_MakeArray_Array_1;                          // 0x0690(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHE_SubtitleSeq                        K2Node_MakeStruct_HE_SubtitleSeq_1;                // 0x06A8(0x0018)(HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller_3;       // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVRCharacter_Demo_C*                    K2Node_DynamicCast_AsVRCharacter_Demo_1;           // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_VOIPInGame_C*                        CallFunc_Create_ReturnValue_7;                     // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       CallFunc_AddComponentByClass_ReturnValue_1;        // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA[0x6];                                      // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USubtitleWB_C*                          CallFunc_Create_ReturnValue_8;                     // 0x0700(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0708(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0720(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0738(0x0018)(HasGetValueTypeHash)
	struct FMissionStructure                      K2Node_CustomEvent_Mission;                        // 0x0750(0x0060)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MyGameInstance_C*                   K2Node_DynamicCast_AsBP_My_Game_Instance_2;        // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x07C4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x07D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x3];                                      // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreboard_UI_C*                       CallFunc_Create_ReturnValue_9;                     // 0x07F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue_2;               // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0800(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0818(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController) == 0x000010, "Wrong alignment on MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController");
static_assert(sizeof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController) == 0x000830, "Wrong size on MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, EntryPoint) == 0x000000, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_InputActionEvent_Key_5) == 0x000008, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_ComponentBoundEvent_VoiceData) == 0x000020, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_ComponentBoundEvent_VoiceData' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_ComponentBoundEvent_MicLevel) == 0x000030, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_ComponentBoundEvent_MicLevel' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_CompressedVoiceData) == 0x000038, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_CompressedVoiceData' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_bUseRadio_1) == 0x000048, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_bUseRadio_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_IsUnderwater_1) == 0x000049, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_IsUnderwater_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_Player) == 0x000050, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_Voice) == 0x000058, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_Voice' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_bUseRadio) == 0x000068, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_bUseRadio' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_IsUnderwater) == 0x000069, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_IsUnderwater' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_K2_IsTearingDown_isTearingDown) == 0x000090, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_K2_IsTearingDown_isTearingDown' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetPlatformName_ReturnValue) == 0x000098, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000A8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, Temp_int_Array_Index_Variable_1) == 0x0000AC, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, Temp_int_Loop_Counter_Variable) == 0x0000B0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetCanTalk_CanTalk) == 0x0000B8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetCanTalk_CanTalk' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_InitVoice_ReturnValue) == 0x0000B9, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_InitVoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetUsingRadio_UsingRadio) == 0x0000BA, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetUsingRadio_UsingRadio' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetUsingRadio_UsingRadio_1) == 0x0000BB, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetUsingRadio_UsingRadio_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000BC, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_IsValid_ReturnValue) == 0x0000BD, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetUsingPushToTalk_UsingPushToTalk) == 0x0000BE, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetUsingPushToTalk_UsingPushToTalk' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000BF, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_HasAuthority_ReturnValue) == 0x0000C0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetGameState_ReturnValue) == 0x0000C8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetUsingPushToTalk_UsingPushToTalk_1) == 0x0000D0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetUsingPushToTalk_UsingPushToTalk_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetPlayerStateArray_ReturnValue) == 0x0000D8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetPlayerStateArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetOwner_ReturnValue) == 0x0000F8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsMP_Player_Controller) == 0x000100, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsMP_Player_Controller' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_K2_GetPawn_ReturnValue) == 0x000110, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000118, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Create_ReturnValue) == 0x000120, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000128, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsInteractable_Pawn) == 0x000138, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsInteractable_Pawn' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_IsValid_ReturnValue_1) == 0x000141, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000148, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_IsValid_ReturnValue_2) == 0x000150, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000151, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsBPCharacter_Demo_1) == 0x000158, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsBPCharacter_Demo_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_CustomEvent_Spectating) == 0x000168, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_CustomEvent_Spectating' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_IsInViewport_ReturnValue) == 0x000178, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, Temp_bool_IsClosed_Variable) == 0x000179, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetGameState_ReturnValue_1) == 0x000180, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetGameInstance_ReturnValue) == 0x000188, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsMP_Game_State) == 0x000190, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsMP_Game_State' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess_4) == 0x000198, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_AsBP_My_Game_Instance) == 0x0001A0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_AsBP_My_Game_Instance' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, K2Node_SwitchEnum_CmpSuccess) == 0x0001B8, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetPlayerName_ReturnValue) == 0x0001C0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GetTransform_ReturnValue) == 0x0001D0, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000200, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_Array_Length_ReturnValue_1) == 0x000208, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_FinishSpawningActor_ReturnValue) == 0x000210, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000218, "Member 'MP_PlayerController_C_ExecuteUbergraph_MP_PlayerController::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
