#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FootstepActionsEnum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function Player_AnimBP.Player_AnimBP_C.ExecuteUbergraph_Player_AnimBP
// 0x0098 (0x0098 - 0x0000)
struct Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP) == 0x000008, "Wrong alignment on Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP");
static_assert(sizeof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP) == 0x000098, "Wrong size on Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, EntryPoint) == 0x000000, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000005, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000008, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x00000D, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x00000E, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_4) == 0x00000F, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000010, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000020, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000030, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000039, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_GetBaseAimRotation_ReturnValue) == 0x00003C, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00005C, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_CalculateDirection_ReturnValue) == 0x000074, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_VSize_ReturnValue) == 0x000078, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000080, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000088, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1) == 0x00008C, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_5) == 0x000090, "Member 'Player_AnimBP_C_ExecuteUbergraph_Player_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_5' has a wrong offset!");

// Function Player_AnimBP.Player_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Player_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Player_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Player_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Player_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Player_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Player_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Player_AnimBP.Player_AnimBP_C.Footstep
// 0x02D0 (0x02D0 - 0x0000)
struct Player_AnimBP_C_Footstep final
{
public:
	EFootstepActionsEnum                          FootstepType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_1;          // 0x0060(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit_1;               // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue_1;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_3;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable_1;                              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_AnimBP_C_Footstep) == 0x000008, "Wrong alignment on Player_AnimBP_C_Footstep");
static_assert(sizeof(Player_AnimBP_C_Footstep) == 0x0002D0, "Wrong size on Player_AnimBP_C_Footstep");
static_assert(offsetof(Player_AnimBP_C_Footstep, FootstepType) == 0x000000, "Member 'Player_AnimBP_C_Footstep::FootstepType' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Player_AnimBP_C_Footstep::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'Player_AnimBP_C_Footstep::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'Player_AnimBP_C_Footstep::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000020, "Member 'Player_AnimBP_C_Footstep::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'Player_AnimBP_C_Footstep::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000038, "Member 'Player_AnimBP_C_Footstep::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_GetAllActorsWithTag_OutActors) == 0x000040, "Member 'Player_AnimBP_C_Footstep::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'Player_AnimBP_C_Footstep::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_GetAllActorsWithTag_OutActors_1) == 0x000060, "Member 'Player_AnimBP_C_Footstep::CallFunc_GetAllActorsWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000070, "Member 'Player_AnimBP_C_Footstep::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SphereTraceSingle_OutHit) == 0x00007C, "Member 'Player_AnimBP_C_Footstep::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SphereTraceSingle_ReturnValue) == 0x000104, "Member 'Player_AnimBP_C_Footstep::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SphereTraceSingle_OutHit_1) == 0x000108, "Member 'Player_AnimBP_C_Footstep::CallFunc_SphereTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SphereTraceSingle_ReturnValue_1) == 0x000190, "Member 'Player_AnimBP_C_Footstep::CallFunc_SphereTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_bBlockingHit) == 0x000191, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_bInitialOverlap) == 0x000192, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Location) == 0x00019C, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A8, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Normal) == 0x0001B4, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_TraceStart) == 0x0001FC, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000214, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000215, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Time_1) == 0x000218, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Distance_1) == 0x00021C, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Location_1) == 0x000220, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ImpactPoint_1) == 0x00022C, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_Normal_1) == 0x000238, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000244, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_PhysMat_1) == 0x000250, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitActor_1) == 0x000258, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitComponent_1) == 0x000260, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitBoneName_1) == 0x000268, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_HitItem_1) == 0x000270, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_ElementIndex_1) == 0x000274, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_FaceIndex_1) == 0x000278, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_TraceStart_1) == 0x00027C, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_BreakHitResult_TraceEnd_1) == 0x000288, "Member 'Player_AnimBP_C_Footstep::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_TryGetPawnOwner_ReturnValue_3) == 0x000298, "Member 'Player_AnimBP_C_Footstep::CallFunc_TryGetPawnOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_IsValid_ReturnValue) == 0x0002A0, "Member 'Player_AnimBP_C_Footstep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, Temp_byte_Variable) == 0x0002A1, "Member 'Player_AnimBP_C_Footstep::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, K2Node_Select_Default) == 0x0002A8, "Member 'Player_AnimBP_C_Footstep::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, Temp_byte_Variable_1) == 0x0002B0, "Member 'Player_AnimBP_C_Footstep::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0002B8, "Member 'Player_AnimBP_C_Footstep::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, K2Node_Select_Default_1) == 0x0002C0, "Member 'Player_AnimBP_C_Footstep::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Player_AnimBP_C_Footstep, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x0002C8, "Member 'Player_AnimBP_C_Footstep::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");

// Function Player_AnimBP.Player_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Player_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Player_AnimBP_C_AnimGraph");
static_assert(sizeof(Player_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Player_AnimBP_C_AnimGraph");
static_assert(offsetof(Player_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Player_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

