#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Desktop

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Desktop.UI_Desktop_C.ExecuteUbergraph_UI_Desktop
// 0x0BB8 (0x0BB8 - 0x0000)
struct UI_Desktop_C_ExecuteUbergraph_UI_Desktop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName;                   // 0x0040(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Program_ID;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0068(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_Icon;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Image_If_Applicatable;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text__if_applicatable_;         // 0x0090(0x0018)()
	class USoundBase*                             K2Node_CustomEvent_Sound__if_applicatable_;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFileMediaSource*                       K2Node_CustomEvent_Media__if_applicatable_;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LevelName__if_applicable_;      // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsLocked;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Program_ID;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_Texture2D__if_applicatable_;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Text__if_applicatable_;               // 0x00D8(0x0018)()
	class USoundBase*                             K2Node_Event_Sounnd__if_applicatable_;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFileMediaSource*                       K2Node_Event_Media__if_applicatable_;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Level_Name__if_applicatable_;         // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0148(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InMinDesiredWidth;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InMinDesiredHeight;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_ProgramContent;                 // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_InPosition;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0180(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool IsGrabbed, class UUI_Drag_C* Window)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_Gate_C*                             CallFunc_Create_ReturnValue;                       // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_MapViewer_C*                        CallFunc_Create_ReturnValue_1;                     // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0300(0x0018)()
	class UUI_Checklist_C*                        CallFunc_Create_ReturnValue_2;                     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Textpad_C*                          CallFunc_Create_ReturnValue_3;                     // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0328(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_1;                 // 0x0360(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_1;                      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_1;                  // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_ImageViewer_C*                      CallFunc_Create_ReturnValue_4;                     // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0390(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x03A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_2;                 // 0x0400(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_2;                      // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_2;                  // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_3;                 // 0x0428(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_3;                      // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_3;                  // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0450(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0468(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_9;          // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_10;         // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_11;         // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_12;         // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_4;                 // 0x04C0(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_4;                      // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_4;                  // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_5;                 // 0x04E8(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_5;                      // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_5;                  // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0510(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0528(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_13;         // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_14;         // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_15;         // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_16;         // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_6;                 // 0x0580(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_6;                      // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_6;                  // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_7;                 // 0x05A8(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_7;                      // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_7;                  // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x05D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x05E8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_17;         // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_18;         // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_19;         // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_20;         // 0x0630(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_8;                 // 0x0640(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_8;                      // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_8;                  // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_9;                 // 0x0668(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_9;                      // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_9;                  // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0690(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x06A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_21;         // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_22;         // 0x06D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_23;         // 0x06E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_24;         // 0x06F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_10;                // 0x0700(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_10;                     // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_10;                 // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_11;                // 0x0728(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_11;                     // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_11;                 // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_12;           // 0x0750(0x0018)()
	class UUI_Calc_C*                             CallFunc_Create_ReturnValue_5;                     // 0x0768(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_25;         // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_26;         // 0x0780(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_ShortCut_C*                         CallFunc_Create_ReturnValue_6;                     // 0x0790(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_12;                // 0x0798(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_12;                     // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_12;                 // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Console_C*                          CallFunc_Create_ReturnValue_7;                     // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Drag_C*                             CallFunc_Create_ReturnValue_8;                     // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsGrabbed;                      // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Drag_C*                             K2Node_CustomEvent_Window;                         // 0x07E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x07E8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Drag_C*                             K2Node_CustomEvent_Widget;                         // 0x0838(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0850(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_13;           // 0x0858(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_14;           // 0x0870(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_27;         // 0x0888(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_28;         // 0x0898(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_29;         // 0x08A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_30;         // 0x08B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_13;                // 0x08C8(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_13;                     // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_13;                 // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_14;                // 0x08F0(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_14;                     // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_14;                 // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_15;           // 0x0918(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_16;           // 0x0930(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_31;         // 0x0948(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_32;         // 0x0958(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_33;         // 0x0968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_34;         // 0x0978(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_15;                // 0x0988(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_15;                     // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_15;                 // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A9[0x7];                                      // 0x09A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_16;                // 0x09B0(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_16;                     // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_16;                 // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0x7];                                      // 0x09D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_17;           // 0x09D8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_18;           // 0x09F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_35;         // 0x0A08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_36;         // 0x0A18(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_37;         // 0x0A28(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_38;         // 0x0A38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_17;                // 0x0A48(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_17;                     // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_17;                 // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_18;                // 0x0A70(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_18;                     // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_18;                 // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_19;           // 0x0A98(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_20;           // 0x0AB0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_39;         // 0x0AC8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_40;         // 0x0AD8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_41;         // 0x0AE8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_42;         // 0x0AF8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_19;                // 0x0B08(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_19;                     // 0x0B20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_19;                 // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLevelName_LevelName_20;                // 0x0B30(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_20;                     // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_20;                 // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B51[0x7];                                      // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_21;           // 0x0B58(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_43;         // 0x0B70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_44;         // 0x0B80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLevelName_LevelName_21;                // 0x0B90(0x0018)()
	class UTexture2D*                             CallFunc_GetLevelName_Icon_21;                     // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelName_IsLocked_21;                 // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop) == 0x000008, "Wrong alignment on UI_Desktop_C_ExecuteUbergraph_UI_Desktop");
static_assert(sizeof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop) == 0x000BB8, "Wrong size on UI_Desktop_C_ExecuteUbergraph_UI_Desktop");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, EntryPoint) == 0x000000, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName) == 0x000040, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon) == 0x000058, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked) == 0x000060, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Program_ID) == 0x000064, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Program_ID' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Name) == 0x000068, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Icon) == 0x000080, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Image_If_Applicatable) == 0x000088, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Image_If_Applicatable' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Text__if_applicatable_) == 0x000090, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Text__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Sound__if_applicatable_) == 0x0000A8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Sound__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_Media__if_applicatable_) == 0x0000B0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_Media__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_LevelName__if_applicable_) == 0x0000B8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_LevelName__if_applicable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_IsLocked) == 0x0000C8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_IsLocked' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Program_ID) == 0x0000CC, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Program_ID' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Texture2D__if_applicatable_) == 0x0000D0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Texture2D__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Text__if_applicatable_) == 0x0000D8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Text__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Sounnd__if_applicatable_) == 0x0000F0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Sounnd__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Media__if_applicatable_) == 0x0000F8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Media__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_Event_Level_Name__if_applicatable_) == 0x000100, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_Event_Level_Name__if_applicatable_' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000110, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetDisplayName_ReturnValue) == 0x000120, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000148, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_SwitchInteger_CmpSuccess) == 0x000160, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, Temp_int_Variable) == 0x000164, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_InMinDesiredWidth) == 0x000168, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_InMinDesiredWidth' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_InMinDesiredHeight) == 0x00016C, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_InMinDesiredHeight' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_ProgramContent) == 0x000170, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_ProgramContent' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_InPosition) == 0x000178, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_InPosition' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CustomEvent_InText) == 0x000180, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CreateDelegate_OutputDelegate) == 0x000198, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001A8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Now_ReturnValue) == 0x0001B0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Year) == 0x0001B8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Month) == 0x0001BC, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Day) == 0x0001C0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Hour) == 0x0001C4, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Minute) == 0x0001C8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Second) == 0x0001CC, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_BreakDateTime_Millisecond) == 0x0001D0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue) == 0x0001D8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0001E8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0001F8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000208, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue) == 0x000218, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000228, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000238, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000248, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000258, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000268, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000278, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000280, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000290, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0002A0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0002C0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Create_ReturnValue) == 0x0002D0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0002D8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0002E8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Create_ReturnValue_1) == 0x0002F8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000300, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Create_ReturnValue_2) == 0x000318, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Create_ReturnValue_3) == 0x000320, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000328, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000340, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000350, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName_1) == 0x000360, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon_1) == 0x000378, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked_1) == 0x000380, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked_1' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Create_ReturnValue_4) == 0x000388, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000390, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0003A8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_5) == 0x0003C0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_6) == 0x0003D0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_7) == 0x0003E0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_8) == 0x0003F0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName_2) == 0x000400, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon_2) == 0x000418, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked_2) == 0x000420, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked_2' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName_3) == 0x000428, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon_3) == 0x000440, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked_3) == 0x000448, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked_3' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000450, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000468, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_9) == 0x000480, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_10) == 0x000490, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_11) == 0x0004A0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_Conv_TextToString_ReturnValue_12) == 0x0004B0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_Conv_TextToString_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName_4) == 0x0004C0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon_4) == 0x0004D8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked_4) == 0x0004E0, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked_4' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_LevelName_5) == 0x0004E8, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_LevelName_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_Icon_5) == 0x000500, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_Icon_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_GetLevelName_IsLocked_5) == 0x000508, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_GetLevelName_IsLocked_5' has a wrong offset!");
static_assert(offsetof(UI_Desktop_C_ExecuteUbergraph_UI_Desktop, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000510, "Member 'UI_Desktop_C_ExecuteUbergraph_UI_Desktop::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
