#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Gate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Gate.UI_Gate_C.ExecuteUbergraph_UI_Gate
// 0x0088 (0x0088 - 0x0000)
struct UI_Gate_C_ExecuteUbergraph_UI_Gate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue_1;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_2;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_3;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Drag_C*                             K2Node_DynamicCast_AsUI_Drag;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Drag_C*                             K2Node_DynamicCast_AsUI_Drag_1;                    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_SecurityPopup_C*                    CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Computer_C*                         K2Node_DynamicCast_AsBP_Computer;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Drag_C*                             CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Gate_C_ExecuteUbergraph_UI_Gate) == 0x000008, "Wrong alignment on UI_Gate_C_ExecuteUbergraph_UI_Gate");
static_assert(sizeof(UI_Gate_C_ExecuteUbergraph_UI_Gate) == 0x000088, "Wrong size on UI_Gate_C_ExecuteUbergraph_UI_Gate");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, EntryPoint) == 0x000000, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetParent_ReturnValue) == 0x000008, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetParent_ReturnValue_1) == 0x000010, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetParent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetOuterObject_ReturnValue) == 0x000018, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetOuterObject_ReturnValue_1) == 0x000020, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetOuterObject_ReturnValue_2) == 0x000028, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetOuterObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetOuterObject_ReturnValue_3) == 0x000030, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetOuterObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_AsUI_Drag) == 0x000038, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_AsUI_Drag' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_AsUI_Drag_1) == 0x000048, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_AsUI_Drag_1' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_IsServer_ReturnValue) == 0x000051, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_Create_ReturnValue) == 0x000058, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_AsBP_Computer) == 0x000068, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_AsBP_Computer' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_ExecuteUbergraph_UI_Gate, Temp_bool_Has_Been_Initd_Variable) == 0x000080, "Member 'UI_Gate_C_ExecuteUbergraph_UI_Gate::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function UI_Gate.UI_Gate_C.CheckFont
// 0x0070 (0x0070 - 0x0000)
struct UI_Gate_C_CheckFont final
{
public:
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0000(0x0058)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Gate_C_CheckFont) == 0x000008, "Wrong alignment on UI_Gate_C_CheckFont");
static_assert(sizeof(UI_Gate_C_CheckFont) == 0x000070, "Wrong size on UI_Gate_C_CheckFont");
static_assert(offsetof(UI_Gate_C_CheckFont, K2Node_MakeStruct_SlateFontInfo) == 0x000000, "Member 'UI_Gate_C_CheckFont::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_CheckFont, CallFunc_GetCurrentCulture_ReturnValue) == 0x000058, "Member 'UI_Gate_C_CheckFont::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gate_C_CheckFont, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000068, "Member 'UI_Gate_C_CheckFont::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

}

