#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VRArms_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DragonIKPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_Item_structs.hpp"


namespace SDK::Params
{

// Function VRArms_AnimBP.VRArms_AnimBP_C.ExecuteUbergraph_VRArms_AnimBP
// 0x0540 (0x0540 - 0x0000)
struct VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVRCharacter_Demo_Client_C*             K2Node_DynamicCast_AsVRCharacter_Demo_Client;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Item                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_1;              // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVRCharacter_Demo_C*                    K2Node_DynamicCast_AsVRCharacter_Demo;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Item                               CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0100(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0xD];                                      // 0x01A3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0xD];                                      // 0x01E3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_3;          // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0228(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_4;          // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0xC];                                      // 0x0244(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDragonData_SingleArmElement           K2Node_MakeStruct_DragonData_SingleArmElement;     // 0x0250(0x0040)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDragonData_SingleArmElement>   K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ReferenceParm)
	struct FDragonData_Overrided_Location_Data    K2Node_MakeStruct_DragonData_Overrided_Location_Data; // 0x02A8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x02C0(0x0018)()
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDragonData_SingleArmElement           K2Node_MakeStruct_DragonData_SingleArmElement_1;   // 0x02E0(0x0040)(NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDragonData_SingleArmElement>   K2Node_MakeArray_Array_1;                          // 0x0328(0x0010)(ReferenceParm)
	struct FDragonData_Overrided_Location_Data    K2Node_MakeStruct_DragonData_Overrided_Location_Data_1; // 0x0338(0x0010)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_5;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_DetectCurrentGesture_ReturnValue;         // 0x034C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_DetectCurrentGesture_ReturnValue_1;       // 0x0354(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActionPose_ReturnValue;                // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActionPose_ReturnValue_1;              // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0360(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_6;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_7;          // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0380(0x0018)()
	bool                                          CallFunc_Montage_IsActive_ReturnValue_1;           // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_1;         // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0450(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0490(0x0030)(IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x04C0(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_5;        // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_4;        // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_6;        // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB[0x5];                                      // 0x04DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x04E0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_5;        // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_7;        // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FA[0x6];                                      // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0500(0x0018)()
	bool                                          CallFunc_Montage_IsActive_ReturnValue_2;           // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_6;        // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0520(0x0018)()
	bool                                          CallFunc_Montage_IsActive_ReturnValue_3;           // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_7;        // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP) == 0x000010, "Wrong alignment on VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP");
static_assert(sizeof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP) == 0x000540, "Wrong size on VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, EntryPoint) == 0x000000, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_DynamicCast_AsVRCharacter_Demo_Client) == 0x000010, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_DynamicCast_AsVRCharacter_Demo_Client' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C1, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000C2, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_SelectRotator_ReturnValue) == 0x0000C4, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_SelectRotator_ReturnValue_1) == 0x0000D0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_SelectRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x0000DC, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000DD, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_Event_DeltaTimeX) == 0x0000E0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x0000E8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_DynamicCast_AsVRCharacter_Demo) == 0x0000F0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_DynamicCast_AsVRCharacter_Demo' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x0000F9, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue_2) == 0x0000FA, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000100, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001A0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue_3) == 0x0001A1, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x0001A2, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0001B0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0001E0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x0001E1, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0001E2, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0001F0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x000220, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_3) == 0x000221, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue) == 0x000228, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000240, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000241, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000242, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_4) == 0x000243, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeStruct_DragonData_SingleArmElement) == 0x000250, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeStruct_DragonData_SingleArmElement' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue_4) == 0x000290, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeArray_Array) == 0x000298, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeStruct_DragonData_Overrided_Location_Data) == 0x0002A8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeStruct_DragonData_Overrided_Location_Data' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_IsValid_ReturnValue_5) == 0x0002B8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x0002B9, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0002C0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeStruct_DragonData_SingleArmElement_1) == 0x0002E0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeStruct_DragonData_SingleArmElement_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000320, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeArray_Array_1) == 0x000328, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, K2Node_MakeStruct_DragonData_Overrided_Location_Data_1) == 0x000338, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::K2Node_MakeStruct_DragonData_Overrided_Location_Data_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_5) == 0x000348, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_DetectCurrentGesture_ReturnValue) == 0x00034C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_DetectCurrentGesture_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_DetectCurrentGesture_ReturnValue_1) == 0x000354, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_DetectCurrentGesture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetActionPose_ReturnValue) == 0x00035C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetActionPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetActionPose_ReturnValue_1) == 0x00035D, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetActionPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000360, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_6) == 0x000378, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_2) == 0x000379, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Montage_IsActive_ReturnValue) == 0x00037A, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Montage_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_NotEqual_NameName_ReturnValue_7) == 0x00037B, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_NotEqual_NameName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x00037C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000380, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Montage_IsActive_ReturnValue_1) == 0x000398, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Montage_IsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_3) == 0x000399, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Location) == 0x00039C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Rotation) == 0x0003A8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Scale) == 0x0003B4, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetOwningComponent_ReturnValue) == 0x0003C0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetOwningComponent_ReturnValue_1) == 0x0003C8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetOwningComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetSocketLocation_ReturnValue) == 0x0003D0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0003DC, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0003E8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_GetSocketLocation_ReturnValue_3) == 0x0003F4, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000400, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00040C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000418, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Location_1) == 0x000424, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x000430, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x00043C, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeTransform_ReturnValue) == 0x000450, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x000480, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeTransform_ReturnValue_1) == 0x000490, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0004C0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_5) == 0x0004D8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_4) == 0x0004D9, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_6) == 0x0004DA, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0004E0, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_5) == 0x0004F8, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_7) == 0x0004F9, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000500, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Montage_IsActive_ReturnValue_2) == 0x000518, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Montage_IsActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_6) == 0x000519, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_MakeLiteralText_ReturnValue_7) == 0x000520, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_Montage_IsActive_ReturnValue_3) == 0x000538, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_Montage_IsActive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP, CallFunc_EqualEqual_TextText_ReturnValue_7) == 0x000539, "Member 'VRArms_AnimBP_C_ExecuteUbergraph_VRArms_AnimBP::CallFunc_EqualEqual_TextText_ReturnValue_7' has a wrong offset!");

// Function VRArms_AnimBP.VRArms_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct VRArms_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VRArms_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on VRArms_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(VRArms_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on VRArms_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(VRArms_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'VRArms_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function VRArms_AnimBP.VRArms_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct VRArms_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(VRArms_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on VRArms_AnimBP_C_AnimGraph");
static_assert(sizeof(VRArms_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on VRArms_AnimBP_C_AnimGraph");
static_assert(offsetof(VRArms_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'VRArms_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

