#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VRCharacter_Demo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FootstepActionsEnum_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "HE_Subtitle_structs.hpp"
#include "HE_Fear_structs.hpp"
#include "HE_SubtitleSeq_structs.hpp"


namespace SDK::Params
{

// Function VRCharacter_Demo.VRCharacter_Demo_C.ExecuteUbergraph_VRCharacter_Demo
// 0x0830 (0x0830 - 0x0000)
struct VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHE_Subtitle                           K2Node_MakeStruct_HE_Subtitle;                     // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHE_Subtitle>                   K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	struct FHE_SubtitleSeq                        K2Node_MakeStruct_HE_SubtitleSeq;                  // 0x0070(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0098(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x00D0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_7;                     // 0x00F0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0108(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_CanAction_Variable;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_8;                     // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_9;                     // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_CanAction_Variable_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0160(0x0010)(ConstParm, ReferenceParm)
	class UUI_Inventory_C*                        CallFunc_Create_ReturnValue;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x017C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x0204(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_2;                            // 0x0290(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x02B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x02C8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x02F0(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_left_hand___1;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value_1;                        // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_left_hand__;                    // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value;                          // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVRArms_AnimBP_C*                       K2Node_DynamicCast_AsVRArms_Anim_BP;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_3;                            // 0x0360(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_10;                    // 0x0388(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_6;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_5;                 // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_4;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_11;                    // 0x03C0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsRightHand;                    // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB[0x1];                                      // 0x03DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Gesture;                        // 0x03DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsVisible;                            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVRPlayer_AnimBP_C*                     K2Node_DynamicCast_AsVRPlayer_Anim_BP;             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0408(0x0018)(ConstParm)
	bool                                          K2Node_Event_Direction;                            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_First;                                // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Hide_1;                               // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Hide;                                 // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Event_ItemClass;                            // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Item_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHE_Fear                               K2Node_Event_Fear;                                 // 0x0448(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0474(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FF[0x1];                                      // 0x04FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnableHMD_ReturnValue;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller;         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SettingsPanel_Theme2_C*             CallFunc_Create_ReturnValue_1;                     // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_4;                            // 0x05C0(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA[0x2];                                      // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x05F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult;  // 0x0600(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_HalfHeightAdjust_1;                   // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust_1;             // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust;                     // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust;               // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0698(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_6;                     // 0x06C0(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x06E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x06F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult_1; // 0x0794(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x081C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x081D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x081E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81F[0x1];                                      // 0x081F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo) == 0x000010, "Wrong alignment on VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo");
static_assert(sizeof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo) == 0x000830, "Wrong size on VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, EntryPoint) == 0x000000, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::EntryPoint' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_MakeStruct_HE_Subtitle) == 0x000008, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_MakeStruct_HE_Subtitle' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_bool_Variable) == 0x000058, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_MakeArray_Array) == 0x000060, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_MakeStruct_HE_SubtitleSeq) == 0x000070, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_MakeStruct_HE_SubtitleSeq' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_1) == 0x000098, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key) == 0x0000B8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_struct_Variable) == 0x0000D0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_7) == 0x0000F0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_7' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_struct_Variable_1) == 0x000108, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_CanAction_Variable) == 0x000120, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_CanAction_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_8) == 0x000128, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_8' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_9) == 0x000140, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_9' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_CanAction_Variable_1) == 0x000158, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_CanAction_Variable_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_object_Variable) == 0x000160, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Create_ReturnValue) == 0x000170, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsValid_ReturnValue_2) == 0x000178, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsLocallyControlled_ReturnValue) == 0x000179, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x00017C, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x000204, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_struct_Variable_2) == 0x000290, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsValid_ReturnValue_3) == 0x0002A8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_2) == 0x0002B0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_3) == 0x0002C8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_Enable) == 0x0002E0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_SetTimer_ReturnValue) == 0x0002E8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_4) == 0x0002F0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_MakeTransform_ReturnValue) == 0x000310, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_left_hand___1) == 0x000340, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_left_hand___1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_value_1) == 0x000341, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_value_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_left_hand__) == 0x000342, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_left_hand__' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_value) == 0x000343, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_value' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetAnimInstance_ReturnValue) == 0x000348, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_AsVRArms_Anim_BP) == 0x000350, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_AsVRArms_Anim_BP' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_bSuccess) == 0x000358, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_struct_Variable_3) == 0x000360, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsValid_ReturnValue_4) == 0x000378, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetObjectClass_ReturnValue) == 0x000380, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_10) == 0x000388, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_10' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_6) == 0x0003A0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_6' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_5) == 0x0003A4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_5' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_4) == 0x0003A8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_3) == 0x0003AC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003B0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetForwardVector_ReturnValue) == 0x0003B4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_11) == 0x0003C0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_11' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x0003D8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0003D9, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_IsRightHand) == 0x0003DA, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_IsRightHand' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_CustomEvent_Gesture) == 0x0003DC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_CustomEvent_Gesture' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0003E8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_IsVisible) == 0x0003F0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_IsVisible' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_AsVRPlayer_Anim_BP) == 0x0003F8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_AsVRPlayer_Anim_BP' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_bSuccess_1) == 0x000400, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_Text) == 0x000408, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_Direction) == 0x000420, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_First) == 0x000421, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_First' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_Hide_1) == 0x000422, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_Hide_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_Hide) == 0x000423, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_Hide' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_ItemClass) == 0x000428, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_ItemClass' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000430, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000438, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_FinishSpawningActor_ReturnValue) == 0x000440, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_Fear) == 0x000448, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_Fear' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_bool_Has_Been_Initd_Variable) == 0x000460, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_DeltaSeconds) == 0x000464, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000468, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_SphereTraceSingle_OutHit) == 0x000474, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_SphereTraceSingle_ReturnValue) == 0x0004FC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_bBlockingHit) == 0x0004FD, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004FE, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_Time) == 0x000500, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_Distance) == 0x000504, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_Location) == 0x000508, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_ImpactPoint) == 0x000514, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_Normal) == 0x000520, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_ImpactNormal) == 0x00052C, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_PhysMat) == 0x000538, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_HitActor) == 0x000540, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_HitComponent) == 0x000548, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_HitBoneName) == 0x000550, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_HitItem) == 0x000558, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_ElementIndex) == 0x00055C, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_FaceIndex) == 0x000560, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_TraceStart) == 0x000564, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakHitResult_TraceEnd) == 0x000570, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000580, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_EnableHMD_ReturnValue) == 0x000588, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_EnableHMD_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GetPlayerController_ReturnValue) == 0x000590, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_AsMP_Player_Controller) == 0x000598, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_AsMP_Player_Controller' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_DynamicCast_bSuccess_2) == 0x0005A0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_2) == 0x0005A4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue_1) == 0x0005A8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_X) == 0x0005AC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_Y) == 0x0005B0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_Z) == 0x0005B4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Create_ReturnValue_1) == 0x0005B8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_struct_Variable_4) == 0x0005C0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputAxisEvent_AxisValue) == 0x0005D8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005DC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0005E0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Abs_ReturnValue) == 0x0005E4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, Temp_bool_IsClosed_Variable) == 0x0005E8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0005E9, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0005EC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Select_Default) == 0x0005F0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_MakeRotator_ReturnValue) == 0x0005F4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_AddActorLocalRotation_SweepHitResult) == 0x000600, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_AddActorLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_HalfHeightAdjust_1) == 0x000688, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_HalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_ScaledHalfHeightAdjust_1) == 0x00068C, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_ScaledHalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_HalfHeightAdjust) == 0x000690, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_Event_ScaledHalfHeightAdjust) == 0x000694, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_Event_ScaledHalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_5) == 0x000698, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Add_FloatFloat_ReturnValue) == 0x0006B0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0006B4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0006B8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_FClamp_ReturnValue) == 0x0006BC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, K2Node_InputActionEvent_Key_6) == 0x0006C0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::K2Node_InputActionEvent_Key_6' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_X_1) == 0x0006D8, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_Y_1) == 0x0006DC, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_BreakVector_Z_1) == 0x0006E0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_MakeVector_ReturnValue_1) == 0x0006E4, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0006F0, "Member 'VRCharacter_Demo_C_ExecuteUbergraph_VRCharacter_Demo::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
