#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VRCharacter_Demo_Client

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FootstepActionsEnum_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "HE_Subtitle_structs.hpp"
#include "HE_Fear_structs.hpp"
#include "HE_SubtitleSeq_structs.hpp"


namespace SDK::Params
{

// Function VRCharacter_Demo_Client.VRCharacter_Demo_Client_C.ExecuteUbergraph_VRCharacter_Demo_Client
// 0x0BD0 (0x0BD0 - 0x0000)
struct VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHE_Subtitle                           K2Node_MakeStruct_HE_Subtitle;                     // 0x0060(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHE_Subtitle>                   K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	struct FHE_SubtitleSeq                        K2Node_MakeStruct_HE_SubtitleSeq;                  // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_6;                     // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x00F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_7;                     // 0x0110(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_CanAction_Variable;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAction_Variable_1;                     // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0130(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0148(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x01EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetOrientationAndPosition_DeviceRotation; // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetOrientationAndPosition_DevicePosition; // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0298(0x0018)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputActionEvent_Key_8;                     // 0x02E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_9;                     // 0x02F8(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_6;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_5;                 // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0328(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_left_hand___1;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value_1;                        // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_left_hand__;                    // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value;                          // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_InputAxisEvent_AxisValue_4;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVRArms_AnimBP_C*                       K2Node_DynamicCast_AsVRArms_Anim_BP;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Inventory_C*                        CallFunc_Create_ReturnValue;                       // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SettingsPanel_Theme2_C*             CallFunc_Create_ReturnValue_1;                     // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x03A0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsRightHand;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Gesture;                        // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x03F8(0x0018)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVRPlayer_AnimBP_C*                     K2Node_DynamicCast_AsVRPlayer_Anim_BP;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsVisible;                            // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0428(0x0018)(ConstParm)
	bool                                          K2Node_Event_Direction;                            // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_First;                                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Hide_1;                               // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Hide;                                 // 0x0443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Event_ItemClass;                            // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Item_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHE_Fear                               K2Node_Event_Fear;                                 // 0x0468(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0484(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x050C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0518(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A3[0x1];                                      // 0x05A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x05D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust_1;                   // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust_1;             // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust;                     // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust;               // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0638(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65B[0x5];                                      // 0x065B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0660(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_3;                            // 0x0678(0x0018)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0690(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0718(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x07AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x07C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EnableHMD_ReturnValue;                    // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x3];                                      // 0x0849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x084C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_1;  // 0x08D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x095C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0968(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0974(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x09FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_2;         // 0x0A84(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0A90(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_3;         // 0x0B18(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B24[0x4];                                      // 0x0B24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0B30(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMP_PlayerController_C*                 K2Node_DynamicCast_AsMP_Player_Controller;         // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0BC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client) == 0x000010, "Wrong alignment on VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client");
static_assert(sizeof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client) == 0x000BD0, "Wrong size on VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, EntryPoint) == 0x000000, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::EntryPoint' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key) == 0x000008, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, Temp_struct_Variable) == 0x000020, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeVector_ReturnValue_1) == 0x000044, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeVector_ReturnValue_2) == 0x000050, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_MakeStruct_HE_Subtitle) == 0x000060, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_MakeStruct_HE_Subtitle' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_MakeArray_Array) == 0x0000B8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_MakeStruct_HE_SubtitleSeq) == 0x0000C8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_MakeStruct_HE_SubtitleSeq' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_6) == 0x0000E0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_6' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_1) == 0x0000F8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_7) == 0x000110, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_7' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_CanAction_Variable) == 0x000128, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_CanAction_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsValid_ReturnValue) == 0x000129, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_CanAction_Variable_1) == 0x00012A, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_CanAction_Variable_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, Temp_object_Variable) == 0x000130, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsValid_ReturnValue_2) == 0x000141, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, Temp_bool_Variable) == 0x000142, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_2) == 0x000148, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsLocallyControlled_ReturnValue) == 0x000160, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000164, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x0001EC, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetOrientationAndPosition_DeviceRotation) == 0x000274, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetOrientationAndPosition_DeviceRotation' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetOrientationAndPosition_DevicePosition) == 0x000280, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetOrientationAndPosition_DevicePosition' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00028C, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, Temp_struct_Variable_1) == 0x000298, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_8) == 0x0002E0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_8' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_9) == 0x0002F8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_9' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_6) == 0x000310, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_6' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000314, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Abs_ReturnValue) == 0x000318, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00031C, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_5) == 0x000320, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_5' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_Enable) == 0x000324, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_K2_SetTimer_ReturnValue) == 0x000328, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsValid_ReturnValue_3) == 0x000330, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetObjectClass_ReturnValue) == 0x000338, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_left_hand___1) == 0x000340, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_left_hand___1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_value_1) == 0x000341, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_value_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_left_hand__) == 0x000342, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_left_hand__' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_value) == 0x000343, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_value' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_4) == 0x000344, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_3) == 0x000348, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetAnimInstance_ReturnValue) == 0x000350, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_2) == 0x000358, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_DynamicCast_AsVRArms_Anim_BP) == 0x000360, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_DynamicCast_AsVRArms_Anim_BP' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_DynamicCast_bSuccess) == 0x000368, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Create_ReturnValue) == 0x000370, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetRightVector_ReturnValue) == 0x000378, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetForwardVector_ReturnValue) == 0x000384, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x000390, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Create_ReturnValue_1) == 0x000398, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, Temp_struct_Variable_2) == 0x0003A0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0003B8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_IsRightHand) == 0x0003B9, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_IsRightHand' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_CustomEvent_Gesture) == 0x0003BC, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_CustomEvent_Gesture' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue_1) == 0x0003C4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003C8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0003CC, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0003D0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeRotator_ReturnValue) == 0x0003D4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Select_Default) == 0x0003E0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0003E4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_MakeRotator_ReturnValue_1) == 0x0003E8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputAxisEvent_AxisValue) == 0x0003F4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_3) == 0x0003F8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000410, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_DynamicCast_AsVRPlayer_Anim_BP) == 0x000418, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_DynamicCast_AsVRPlayer_Anim_BP' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_DynamicCast_bSuccess_1) == 0x000420, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_IsVisible) == 0x000421, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_IsVisible' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_Text) == 0x000428, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_Direction) == 0x000440, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_First) == 0x000441, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_First' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_Hide_1) == 0x000442, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_Hide_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_Hide) == 0x000443, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_Hide' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_ItemClass) == 0x000448, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_ItemClass' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000450, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000458, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_FinishSpawningActor_ReturnValue) == 0x000460, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_Fear) == 0x000468, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_Fear' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_DeltaSeconds) == 0x000480, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000484, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00050C, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_SphereTraceSingle_OutHit) == 0x000518, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_SphereTraceSingle_ReturnValue) == 0x0005A0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_bBlockingHit) == 0x0005A1, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_bInitialOverlap) == 0x0005A2, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_Time) == 0x0005A4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_Distance) == 0x0005A8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_Location) == 0x0005AC, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_ImpactPoint) == 0x0005B8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_Normal) == 0x0005C4, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_ImpactNormal) == 0x0005D0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_PhysMat) == 0x0005E0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_HitActor) == 0x0005E8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_HitComponent) == 0x0005F0, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_HitBoneName) == 0x0005F8, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_HitItem) == 0x000600, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_ElementIndex) == 0x000604, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_FaceIndex) == 0x000608, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_TraceStart) == 0x00060C, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_BreakHitResult_TraceEnd) == 0x000618, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_HalfHeightAdjust_1) == 0x000624, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_HalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_ScaledHalfHeightAdjust_1) == 0x000628, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_ScaledHalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_HalfHeightAdjust) == 0x00062C, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_Event_ScaledHalfHeightAdjust) == 0x000630, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_Event_ScaledHalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, K2Node_InputActionEvent_Key_4) == 0x000638, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000650, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000654, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000658, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x000659, "Member 'VRCharacter_Demo_Client_C_ExecuteUbergraph_VRCharacter_Demo_Client::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
