#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Confirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Comfirmation_structs.hpp"
#include "S_UI_AudioSettings_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Confirmation.W_Confirmation_C
// 0x00A8 (0x0308 - 0x0260)
class UW_Confirmation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_No;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Yes;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoFocus;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_YesFocus;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Seconde;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Seconds;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_Comfirmation                                ConfirmationFor;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CancelAnim_;                                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeMake;                                          // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConfirmationTime;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OptionsRef;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MainMenu_C*                          MainMenuRef;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_AudioSettings                    UI_Audio;                                          // 0x02C8(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Confirmation(int32 EntryPoint);
	void BndEvt__Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_No_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void No();
	void RefreshFocus();
	void Construct();
	void BndEvt__Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_No_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void UpdateConfirmation(const class FText& Title, const class FText& Message, E_Comfirmation ConfirmationFor_0);
	void OnSuccess_9E20E26A458E94E603BACCBDDD8B2B9B();
	void OnFailure_9E20E26A458E94E603BACCBDDD8B2B9B();
	class UWidget* CustomNavigation_Left(EUINavigation Navigation_0);
	class UWidget* CustomNavigation_Right(EUINavigation Navigation_0);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PlayClickSound();
	void PlayHoveredSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Confirmation_C">();
	}
	static class UW_Confirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Confirmation_C>();
	}
};
static_assert(alignof(UW_Confirmation_C) == 0x000008, "Wrong alignment on UW_Confirmation_C");
static_assert(sizeof(UW_Confirmation_C) == 0x000308, "Wrong size on UW_Confirmation_C");
static_assert(offsetof(UW_Confirmation_C, UberGraphFrame) == 0x000260, "Member 'UW_Confirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, Button_No) == 0x000268, "Member 'UW_Confirmation_C::Button_No' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, Button_Yes) == 0x000270, "Member 'UW_Confirmation_C::Button_Yes' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, Image_NoFocus) == 0x000278, "Member 'UW_Confirmation_C::Image_NoFocus' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, Image_YesFocus) == 0x000280, "Member 'UW_Confirmation_C::Image_YesFocus' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, ProgressBar_Seconde) == 0x000288, "Member 'UW_Confirmation_C::ProgressBar_Seconde' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, TextBlock_Message) == 0x000290, "Member 'UW_Confirmation_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, TextBlock_Seconds) == 0x000298, "Member 'UW_Confirmation_C::TextBlock_Seconds' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, TextBlock_Title) == 0x0002A0, "Member 'UW_Confirmation_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, ConfirmationFor) == 0x0002A8, "Member 'UW_Confirmation_C::ConfirmationFor' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, CancelAnim_) == 0x0002A9, "Member 'UW_Confirmation_C::CancelAnim_' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, TimeMake) == 0x0002AC, "Member 'UW_Confirmation_C::TimeMake' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, ConfirmationTime) == 0x0002B0, "Member 'UW_Confirmation_C::ConfirmationTime' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, OptionsRef) == 0x0002B8, "Member 'UW_Confirmation_C::OptionsRef' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, MainMenuRef) == 0x0002C0, "Member 'UW_Confirmation_C::MainMenuRef' has a wrong offset!");
static_assert(offsetof(UW_Confirmation_C, UI_Audio) == 0x0002C8, "Member 'UW_Confirmation_C::UI_Audio' has a wrong offset!");

}

