#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_LevelStats_structs.hpp"
#include "E_MainMenu_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Difficulty_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function W_MainMenu.W_MainMenu_C.ExecuteUbergraph_W_MainMenu
// 0x0568 (0x0568 - 0x0000)
struct W_MainMenu_C_ExecuteUbergraph_W_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionsSearchSetting>         Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_1;                      // 0x0030(0x0010)(ConstParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyByPi_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Cos_ReturnValue;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0090(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SettingsPanel_Theme2_C*             CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable_1;                            // 0x00F8(0x0010)(ReferenceParm)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item;                           // 0x0108(0x0108)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0220(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0270(0x0018)()
	class UWidget*                                CallFunc_GetActualOverlay_ReturnValue;             // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x02A8(0x0018)(ConstParm)
	class UFindSessionsCallbackProxyAdvanced*     CallFunc_FindSessionsAdvanced_ReturnValue;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_TemplateTitle_C*>             CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_TemplateTitle_C*                     CallFunc_Array_Get_Item_1;                         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0300(0x0028)()
	class UW_ServerButton_C*                      CallFunc_Create_ReturnValue_1;                     // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActualOverlay_ReturnValue_1;           // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActualOverlay_ReturnValue_2;           // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MyGameInstance_C*                   K2Node_DynamicCast_AsBP_My_Game_Instance;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyByPi_ReturnValue_1;               // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Cos_ReturnValue_1;                        // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Game_Button_C*                       CallFunc_Create_ReturnValue_2;                     // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_4;          // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetSaveGameSlotsByType_ReturnValue;       // 0x0418(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UButton*>                        Temp_object_Variable;                              // 0x0460(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MainMenu                                    Temp_byte_Variable_8;                              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x2];                                      // 0x0472(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MainMenu                                    Temp_byte_Variable_9;                              // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MyGameInstance_C*                   K2Node_DynamicCast_AsBP_My_Game_Instance_1;        // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_1; // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuActor_C*                        K2Node_DynamicCast_AsBP_Menu_Actor;                // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_5;          // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Menu_Computer_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue_2; // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_MainMenu_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x04E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_MainMenu_C*                          CallFunc_Array_Get_Item_3;                         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503[0x1];                                      // 0x0503(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0504(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0515(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0516(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0517(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_5;                // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0528(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UButton*>                        K2Node_Select_Default_5;                           // 0x0538(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UButton*                                CallFunc_Array_Get_Item_4;                         // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556[0x2];                                      // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x055D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x055E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x055F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0562(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0563(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000008, "Wrong alignment on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(sizeof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000568, "Wrong size on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, EntryPoint) == 0x000000, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_struct_Variable) == 0x000008, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable) == 0x000018, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_1) == 0x00002C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable) == 0x00002D, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CustomEvent_Results_1) == 0x000030, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_2) == 0x000040, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable) == 0x000044, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_3) == 0x000048, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_1) == 0x000049, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_float_Variable) == 0x000064, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_MultiplyByPi_ReturnValue) == 0x00006C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_MultiplyByPi_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Less_FloatFloat_ReturnValue) == 0x000070, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Cos_ReturnValue) == 0x000074, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000078, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000080, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SelectFloat_ReturnValue) == 0x000084, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_4) == 0x000088, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_5) == 0x000089, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CustomEvent_Results) == 0x000090, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_2) == 0x0000A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_6) == 0x0000A1, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_byte_Variable_7) == 0x0000A2, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_3) == 0x0000A8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable_1) == 0x0000AC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable_2) == 0x0000B4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Event_IsDesignTime) == 0x0000D0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable_2) == 0x0000D4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000DC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SelectFloat_ReturnValue_1) == 0x0000E0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_4) == 0x0000E8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SelectFloat_ReturnValue_2) == 0x0000EC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000F4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_struct_Variable_1) == 0x0000F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Get_Item) == 0x000108, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Length_ReturnValue_1) == 0x000214, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000220, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeArray_Array) == 0x000260, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Format_ReturnValue) == 0x000270, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActualOverlay_ReturnValue) == 0x000288, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActualOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetRenderOpacity_ReturnValue) == 0x000290, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000294, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000298, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00029C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00029D, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Variable) == 0x0002A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default) == 0x0002A4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default_1) == 0x0002A5, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Text) == 0x0002A8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_FindSessionsAdvanced_ReturnValue) == 0x0002C0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_FindSessionsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_1) == 0x0002C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002CC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0002E0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Get_Item_1) == 0x0002F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Length_ReturnValue_2) == 0x0002F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002FC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeStruct_SlateColor) == 0x000300, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue_1) == 0x000328, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_AddChild_ReturnValue) == 0x000330, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000338, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default_2) == 0x000340, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Variable_1) == 0x000344, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActualOverlay_ReturnValue_1) == 0x000348, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActualOverlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActualOverlay_ReturnValue_2) == 0x000350, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActualOverlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000358, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Variable_2) == 0x00035C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000360, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000364, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default_3) == 0x000368, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x00036C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000370, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x000374, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_FClamp_ReturnValue) == 0x000378, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00037C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_FClamp_ReturnValue_1) == 0x000380, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000384, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x000388, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000390, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_SlotAsOverlaySlot_ReturnValue_3) == 0x000398, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_SlotAsOverlaySlot_ReturnValue_3' has a wrong offset!");
