#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Dropdown_Theme2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.OnOptionSwitched__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature final
{
public:
	class FString                                 SelectedOption_0;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature) == 0x000008, "Wrong alignment on WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature");
static_assert(sizeof(WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature) == 0x000010, "Wrong size on WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature");
static_assert(offsetof(WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature, SelectedOption_0) == 0x000000, "Member 'WB_Dropdown_Theme2_C_OnOptionSwitched__DelegateSignature::SelectedOption_0' has a wrong offset!");

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.ExecuteUbergraph_WB_Dropdown_Theme2
// 0x0020 (0x0020 - 0x0000)
struct WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2) == 0x000008, "Wrong alignment on WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2");
static_assert(sizeof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2) == 0x000020, "Wrong size on WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2");
static_assert(offsetof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2, EntryPoint) == 0x000000, "Member 'WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2, K2Node_ComponentBoundEvent_SelectedItem) == 0x000008, "Member 'WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2, K2Node_ComponentBoundEvent_SelectionType) == 0x000018, "Member 'WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WB_Dropdown_Theme2_C_ExecuteUbergraph_WB_Dropdown_Theme2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WB_Dropdown_Theme2_C_BndEvt__WB_Dropdown_ComboBoxString_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Dropdown_Theme2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Dropdown_Theme2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Dropdown_Theme2_C_PreConstruct");
static_assert(sizeof(WB_Dropdown_Theme2_C_PreConstruct) == 0x000001, "Wrong size on WB_Dropdown_Theme2_C_PreConstruct");
static_assert(offsetof(WB_Dropdown_Theme2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Dropdown_Theme2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.Set_SelectedOption
// 0x0010 (0x0010 - 0x0000)
struct WB_Dropdown_Theme2_C_Set_SelectedOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Dropdown_Theme2_C_Set_SelectedOption) == 0x000008, "Wrong alignment on WB_Dropdown_Theme2_C_Set_SelectedOption");
static_assert(sizeof(WB_Dropdown_Theme2_C_Set_SelectedOption) == 0x000010, "Wrong size on WB_Dropdown_Theme2_C_Set_SelectedOption");
static_assert(offsetof(WB_Dropdown_Theme2_C_Set_SelectedOption, Option) == 0x000000, "Member 'WB_Dropdown_Theme2_C_Set_SelectedOption::Option' has a wrong offset!");

// Function WB_Dropdown_Theme2.WB_Dropdown_Theme2_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct WB_Dropdown_Theme2_C_Setup final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Dropdown_Theme2_C_Setup) == 0x000008, "Wrong alignment on WB_Dropdown_Theme2_C_Setup");
static_assert(sizeof(WB_Dropdown_Theme2_C_Setup) == 0x000038, "Wrong size on WB_Dropdown_Theme2_C_Setup");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_Dropdown_Theme2_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_Dropdown_Theme2_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_FindOptionIndex_ReturnValue) == 0x00000C, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Dropdown_Theme2_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WB_Dropdown_Theme2_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

