#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Gamma_Theme2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Gamma_Theme2.WB_Gamma_Theme2_C
// 0x0030 (0x0290 - 0x0260)
class UWB_Gamma_Theme2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                Slider;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnValueChanged;                                    // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseCaptureEnd;                                 // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnValueChanged__DelegateSignature(float Gamma);
	void OnMouseCaptureEnd__DelegateSignature();
	void ExecuteUbergraph_WB_Gamma_Theme2(int32 EntryPoint);
	void BndEvt__WB_Slider_Slider_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__WB_Slider_Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void Construct();
	void Set_SliderValue(float InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Gamma_Theme2_C">();
	}
	static class UWB_Gamma_Theme2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Gamma_Theme2_C>();
	}
};
static_assert(alignof(UWB_Gamma_Theme2_C) == 0x000008, "Wrong alignment on UWB_Gamma_Theme2_C");
static_assert(sizeof(UWB_Gamma_Theme2_C) == 0x000290, "Wrong size on UWB_Gamma_Theme2_C");
static_assert(offsetof(UWB_Gamma_Theme2_C, UberGraphFrame) == 0x000260, "Member 'UWB_Gamma_Theme2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Gamma_Theme2_C, Slider) == 0x000268, "Member 'UWB_Gamma_Theme2_C::Slider' has a wrong offset!");
static_assert(offsetof(UWB_Gamma_Theme2_C, OnValueChanged) == 0x000270, "Member 'UWB_Gamma_Theme2_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UWB_Gamma_Theme2_C, OnMouseCaptureEnd) == 0x000280, "Member 'UWB_Gamma_Theme2_C::OnMouseCaptureEnd' has a wrong offset!");

}

